{
  "_meta": {
    "sources": [
      {
        "json": "D&DFPHB",
        "abbreviation": "D&DF-PHB",
        "full": "One Piece Dungeons and Devil Fruits Player Handbook",
        "authors": [
          "OneWorldHD"
        ],
        "convertedBy": [
          "Tarun",
          "SirTalpadeRedstoneville58"
        ],
        "version": "2.1.1",
        "color": "0B3075",
        "url": "https://homebrewery.naturalcrit.com/share/ItlMSW6ztZTm"
      }
    ],
    "dateAdded": 1760976825,
    "dateLastModified": 1760976825,
    "edition": "classic"
  },
  "book": [
    {
      "name": "Dungeons and Devil Fruits",
      "source": "D&DF-PHB",
      "group": "homebrew",
      "id": "D&DF-PHB",
      "published": "",
      "cover": {
        "type": "external",
        "url": "https://i.imgur.com/Uw1QgF6.jpg"
      },
      "author": "OneWorldHD",
      "contents": [
        {
          "name": "Starting Information",
          "headers": [
            "Some Basic Info About These Rules",
            "The World of One Piece"
          ],
          "ordinal": {
            "type": "chapter",
            "identifier": 0
          }
        },
        {
          "name": "Making a Character",
          "headers": [
            "Setting Up a Character",
            "1st level and beyond"
          ],
          "ordinal": {
            "identifier": 1,
            "type": "chapter"
          }
        },
        {
          "name": "Races",
          "headers": [
            "Human",
            "Fishman",
            "Merfolk",
            "Sky Islander",
            "Mink",
            "Yokai Tribesman",
            "Cyborg",
            "Dwarf [Optional]",
            "Lunarian [Optional]",
            "Elbaf Giant [Optional]"
          ],
          "ordinal": {
            "identifier": 2,
            "type": "chapter"
          }
        },
        {
          "name": "Class",
          "headers": [
            "Bruiser",
            "Chemist",
            "Devilforged",
            "Hybrid",
            "Marksman",
            "Martial Artist",
            "Priest",
            "Rogue",
            "Skald",
            "Tinkerer",
            "Warrior"
          ],
          "ordinal": {
            "type": "chapter",
            "identifier": 3
          }
        },
        {
          "name": "Crew and Background",
          "headers": [
            "Name and Physical Characteristics",
            "Inspiration Dice Alternative: Pirate Prestige",
            "Crew Roles",
            "Backgrounds",
            "Character Dreams"
          ],
          "ordinal": {
            "type": "chapter",
            "identifier": 4
          }
        },
        {
          "name": "Equipment",
          "headers": [
            "Wealth",
            "Armor and Shields",
            "Weapons",
            "Adventuring Gear",
            "Mounts and Vehciles",
            "Special Equipment",
            "Expenses",
            "Trinkets"
          ],
          "ordinal": {
            "type": "chapter",
            "identifier": 5
          }
        },
        {
          "name": "Customization & Feats",
          "headers": [
            "Multiclassing",
            "Feats"
          ],
          "ordinal": {
            "type": "chapter",
            "identifier": 6
          }
        },
        {
          "name": "Devil Fruits & Haki",
          "headers": [
            "Haki",
            "Devil Fruits",
            "Devil Fruit Generation",
            "Designing a Devil Fruit Sheet with Steps",
            "Designing A Paramecia Devil Fruit Sheet",
            "Designing a Zoan Devil Fruit Sheet",
            "Designing a Logia Devil Fruit Sheet"
          ],
          "ordinal": {
            "type": "chapter",
            "identifier": 7
          }
        },
        {
          "name": "Spell Lists",
          "headers": [
            "Class Spells",
            "Custom Spells"
          ],
          "ordinal": {
            "type": "chapter",
            "identifier": 8
          }
        }
      ]
    }
  ],
  "bookData": [
    {
      "id": "D&DF-PHB",
      "source": "D&DF-PHB",
      "data": [
        {
          "type": "section",
          "name": "Starting Information",
          "page": 3,
          "entries": [
            {
              "type": "image",
              "href": {
                "type": "external",
                "url": "https://i.imgur.com/4kws2K4.jpg"
              }
            },
            "DMs, be sure to explore the [Dungeons and Devil Fruits Dungeon Master's Guide](https://homebrewery.naturalcrit.com/share/sK-UDzk7x8U_) for this project! It offers a wealth of information beneficial for planning your campaign. Also be sure to check out the [Devil Fruit Encyclopedia](https://homebrewery.naturalcrit.com/share/24DkobVl8IGZ), which includes much more information on Devil Fruit powers and details to include in your game!",
            "This rulebook aims to be a One Piece-themed adaptation of the Wizards of the Coast D&D 5e rule books. Familiarizing yourself with the basics of these rules before engaging with this system is essential. Once you've grasped the basic rules and terminology, you're good to go.  [Read this to get started if you are new to 5e!](https://dnd.wizards.com/articles/features/basicrules)",
            "Furthermore, you'll need a solid understanding of the One Piece Universe. As a Dungeon Master, it's recommended that you watch or read a substantial portion of the series to effectively run this type of game. While it's less critical for players to be familiar with aspects outside of this rulebook, it is still beneficial. Below is a list of considerations and preparations needed before running a game with these rules.",
            {
              "type": "section",
              "name": "Some Basic Info About These Rules",
              "page": 3,
              "entries": [
                "If You're New to D&D or One Piece",
                {
                  "type": "list",
                  "items": [
                    "Have a way to run the campaign. If playing online, use a platform such as Roll20 or  something similar. If playing in person, make sure to have many of the required dice and character sheets set up prior to running a game.",
                    "Come up with a story and world! You can either set up a sandbox world or make a clear path for your players to take if they are less adventurous. Make sure to discuss this with them prior so that everyone is on the same page about what they find fun.",
                    "As stated above, familiaize yourself with One Piece lore and the D&D rules for playes and Dungeon Masters. Below are some more resources to check out!"
                  ]
                },
                {
                  "type": "entries",
                  "name": "Useful Links",
                  "page": 3,
                  "entries": [
                    "Devil Fruits - These are magical fruits that have the ability to grant the eater super-human powers. There are some downsides to this, however. Read this to learn about Devil Fruits!",
                    "World of One Piece - Most of the One Piece world is full of a variety of wacky large and small islands. There are very few large continents in this world. There is also the grand lind, the red line, the calm belt, and different sections of the ocean. Read this to learn more about the World of One Piece!",
                    "Fighting Styles - There are many unique and powerful ways of fighting, even if you are a non-devil fruit user! Read this to learn more about these fighting styles in detail!"
                  ]
                },
                {
                  "type": "entries",
                  "name": "Da Rules! (5e)",
                  "page": 3,
                  "entries": [
                    "If you are running a campaign with these rules, it is important to understand the rules of 5th Edition. I would highly recommend using the Player's Handbook and Dungeon Master's Guide in conjunction with the rules in this book. Most of the rules from 5e will apply to this campaign setting in this rulebook, only because they are the easiest to understand for most people. The only things that will be different are the races, classes, some spells, items, and a few other rules. Take what you want from the 5e rules and add them to your own game if a rule isn't covered in this book!",
                    "Many of the standard rules will apply from the 5e rulebooks such as:",
                    {
                      "type": "list",
                      "items": [
                        "Spells, class mechanics, leveling, ability scores, character sheets, and skills work similarly with some modifications.",
                        "Combat mechanics will function pretty much the same.",
                        "Classes and races have been changed or overhauled to fit the One Piece theme.",
                        "New player feats will be added and some will be slightly changed.",
                        "Mages and magic are treated a bit different in this world and can be explained through science, spiritual skills, and elemental powers people naturally use.",
                        "Most supernatural phenomenon are explained by devil fruits and haki, which serve as a potential supplement for magic items."
                      ]
                    }
                  ]
                },
                {
                  "type": "entries",
                  "name": "Important Side Note",
                  "page": 3,
                  "entries": [
                    "Understand that when reading this, it is only used as a guide to help you run or play in a game of your own. It is entirely fanmade homebrew. In other words, the Dungeon Master has the final say about what the rules are. You could use 100% of these rules or only 10% , it is up to how you want to run your world! There may be a few typos or grammatical errors, and I will try to spot and fix them. Otherwise, thank you for reading this!"
                  ]
                },
                {
                  "type": "image",
                  "href": {
                    "type": "external",
                    "url": "https://logos-world.net/wp-content/uploads/2023/03/Straw-Hat-Logo.png"
                  }
                }
              ]
            },
            {
              "type": "section",
              "name": "The World of One Piece",
              "page": 4,
              "entries": [
                "The map below gives a basic outline and potential roadmap for you to use for your own adventure. This section will also brief players who are new to the geography or nature of the One Piece world. You can either use the islands, factions, kingdoms, and objectives established in the main series. Or you could opt to make an entirely separate alternate universe with new factions, islands, and kingdoms custom tailored for your group's adventure.",
                "Alternatively, you could use a mix of both types of settings, giving homage to certain locations, groups, and characters with your own spin while creating several new islands, allies, and villains for the group to meet. However you choose to run your campaign, using this world map will give you and your players an idea of a path to take to move forward toward adventure and the One Piece.",
                {
                  "type": "image",
                  "href": {
                    "type": "external",
                    "url": "https://i.imgur.com/HCAPGPS.png"
                  }
                },
                {
                  "type": "entries",
                  "name": "The Four Blue Seas",
                  "page": 4,
                  "entries": [
                    {
                      "type": "list",
                      "items": [
                        {
                          "type": "entries",
                          "name": "North Blue",
                          "entries": [
                            "A sea in which many legendary pirates and factions were birthed. The North Blue contains many great kingdoms, as well as once being ruled by the Vinsmoke family, and mostly ocean with smaller islands and some continents."
                          ]
                        },
                        {
                          "type": "entries",
                          "name": "East Blue",
                          "entries": [
                            "Considered the weakest of all the seas. The East Blue contains mostly ocean with many small islands and some continents."
                          ]
                        },
                        {
                          "type": "entries",
                          "name": "South Blue",
                          "entries": [
                            "A sea that, similar to the North Blue, was the home of many famous pirates. The South Blue contains many great kingdoms and mostly ocean with smaller islands and some continents."
                          ]
                        },
                        {
                          "type": "entries",
                          "name": "West Blue",
                          "entries": [
                            "A sea riddled with crime, being ruled by various mafia organizations that run a strong Underworld. The West blue contains mostly ocean with smaller islands."
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "type": "entries",
                  "name": "The Grand Line",
                  "page": 5,
                  "entries": [
                    "The Grand Line attracts an unsurmountable number of pirates and adventurers, both powerful and weak, to its seas. Many fail to even reach this sea, struggling to navigate its treacherous waters, extreme weather conditions, and powerful rival pirate crews or Marine forces. This sea also requires special tools to navigate. \"Log Pose\" compasses, for example, must be used to properly navigate and point ships to the next island since the sea's abnormal magnetic fields do not allow for ordinary compasses to be used. Moreover, Log Poses only allow for a limited and linear path to be taken because it will only point to one location at a time once it adjusts to the magnetic field of a nearby island.",
                    {
                      "type": "list",
                      "items": [
                        {
                          "type": "entries",
                          "name": "Reverse Mountain and Red Line",
                          "entries": [
                            "Reaching the grand line from the four blue seas requires travel by ship up through the Reverse mountain, which will carry any ship up with its powerful current and down into a single steep river into the Grand Line. This is a one-way trip, however, and a ship cannot pass back up through the reverse mountain once they've arrived in the Grand Line due to the powerful currents.",
                            "Alternatively, one could reach the grand line by traveling across the calm belt. However, the calm belt is incredibly difficult to traverse due to reasons specified below, and is primarily crossed only by the Marines. One last way one could theoretically reach the Grand Line is by traveling across the Red Line itself, which is a massive land formation that is virtually impossible to cross for an ordinary person by foot, to loop around the calm belt and into central portion."
                          ]
                        },
                        {
                          "type": "entries",
                          "name": "Calm Belt",
                          "entries": [
                            "This calm strip of sea that rests on both outer borders on each side of the Grand Line, contains many islands and creatures within it. However, despite its name, crossing the Calm Belt can prove to be instantly fatal to even the most powerful of pirate crews. Due to the complete absence of ocean currents and winds throughout the Calm Belt, there are very few ships that can effectively move through it. Additionally, a near-infinite number of Sea Kings and other sea monsters make the Calm Belt their home and will immediately destroy any suspecting ship or creature attempting to move over it.",
                            "Only a select few ships manufactured by the Marines or special Kingdoms will dare to cross the Calm Belt using seastone technology or sea monster guides to bypass the dangers it presents."
                          ]
                        },
                        {
                          "type": "entries",
                          "name": "Paradise",
                          "entries": [
                            "The first half of the Grand Line, often referred to as \"paradise\" when compared to the latter half of the Grand Line. Despite its name, this sea is notably dangerous and will eliminate most newbie pirates that attempt to explore it. Paradise contains many small continents and islands with extreme weather conditions, many of which never change in season, temperature, or climate. Each piece of land may contain villages, cities, kingdoms, or countries. Weather conditions all across Paradise are often lethal to crews without gifted navigators and sturdy ships.",
                            "The Marines, warlords, armies, and established pirate crews will all defend their territories here or attack anyone unfamiliar on sight. Additionally, Sea Monsters and legendary beasts can be found commonly in the oceans or on islands within paradise that can easily threaten to annihilate any unsuspecting ship or traveler."
                          ]
                        },
                        {
                          "type": "entries",
                          "name": "New World",
                          "entries": [
                            "Both the latter half of the Grand Line and the final frontier, this is the place where the strongest of the strong reside. It is also the deadliest sea, forcing even the most experienced of crews and ships into submission with its ruthless and completely unpredictable weather, hostile climates on many islands, and other supernatural threats that may randomly appear at a moments notice. Much like Paradise, there are many small continents and islands that are spread out across the sea.",
                            "Legendary pirate crews rule over their own massive territories, earning their captains the title \"Emperor\" or \"Yonko\". Each compete for territory and resources, with some even aiming for the title of \"Pirate King\". Territory of the Emperor crews may encompass a massive range of kingdoms, countries, or large sections of ocean. It is often said to survive here, one must align with a Yonko crew or inevitably war against them. There are typically four of these emperors, though that number may change depending on the circumstances and balance of power in the New World. Even the Navy is often afraid of exploring these seas or challenging the mighty Yonko, as more than one Yonko alliance or fleet forming an alliance against them could threaten the entire World Government."
                          ]
                        },
                        {
                          "type": "entries",
                          "name": "Final Island",
                          "entries": [
                            "To avoid massive spoilers, this section will intentionally be left vague.",
                            "This legendary place rests at the very end of the Grand Line, within the final stretch of the New World. Within this mysterious location exists a colossal treasure that has had most pirates searching for decades to find. It also contains all the mysteries of the past, which will be useful to those searching for the truth of the world. The nature or exact contents of this location are still left open to interpretation, though any DM running their game can allow their players to reach this place by special means specific to their own adventure and world. The name of this island itself can be changed to fit a different plot or storyline for each world.",
                            "However one chooses to run this location, it will most likely be reached at the very end of a campaign and will allow players to access the One Piece in some way. Perhaps it can act as a gateway to the treasure. It could be an underwater city which rises to the sky to carry the players to the treasure. It could even itself be a weapon of some sort that has the capacity to destroy the planet. Because the mystery of the One Piece and Raftel has not been revealed yet (as of 2022), it is fair to insert your own spin on what it could be that players find here"
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "type": "section",
          "name": "Making a Character",
          "page": 8,
          "entries": [
            {
              "type": "image",
              "href": {
                "type": "external",
                "url": "https://lh3.googleusercontent.com/Ryg5ih-fOWbpEGDpbJYJz5RTq3_28Tvo2h3JQRCdiz16lw5ghitDMN6hcWA57g0d6_8VOqQYcCemRBOfZGQA64ZKkFOn71zuF1LDsXwCh4ywF-_z6VqxbBqmbQvK_-PWfZcztxDd1WDTEEUHX6GdP60"
              }
            },
            {
              "type": "section",
              "name": "Setting Up a Character",
              "page": 8,
              "entries": [
                "This is typically the first step in any tabletop RPG or D&D-styled game. Use your imagination to think up what type of character you want to be in this world. Make sure it remains mostly thematic in regards to the setting, as this isn't a standard D&D campaign.",
                "Think about what race you would like your character to be, their personality, goals, back story, specialties, career, appearance, traits, and relationships. Once you have all of these qualities decided, start following these steps below and writing everything down.",
                "Using a \"Character Sheet\" provided by Wizards of the Coast for 5th Edition, you can track much of this. You may need to make a few modifications for certain things, like tracking Devil Fruit powers.",
                {
                  "type": "entries",
                  "page": 8,
                  "name": "Choosing Your Race",
                  "entries": [
                    "Races in the One Piece world are very unique and each exhibit many different abilities and defining traits. Deciding your race can be pretty important to describing your character's appearance and abilities, as well as occasionally defining their goals. Humans are easily the most common race to find when exploring the planet, although you may sometimes find individuals or communities of non-humans living in different areas, typically away from humans.",
                    "If you are unsure of which race to go with, Human can be an easy choice. However, races such as Fishmen, Merfolk, Minks, Sky Tribesman, Kuja, Dwarves, and others are all possible races to choose from. More information on these races are listed in Chapter 2."
                  ]
                },
                {
                  "type": "entries",
                  "page": 8,
                  "name": "Choosing Your Class",
                  "entries": [
                    "Each character should specialize in a field while sailing the seas with their crew. A class will determine your prominent talents and skills, allowing your character to hone and grow their abilities throughout the adventure. For example, a Warrior may focus mainly on fighting while tinkerers can be useful in performing specifics tasks outside of combat that may benefit the group, such as navigating. While having an all-around useful character is important, sometimes it doesn't hurt to have a character that tends to be extremely good at only one thing, so long as they benefit the group and feel fun to play. A well-rounded party can make the journey far more enjoyable in the long-run.",
                    "Put some time into deciding what you want your character's role to be in the crew. Maybe discuss it with others in the group to see what would work best for everyone. However, make sure to choose something you will have fun with and appreciate. Once you have a general idea for what your class will be, pick from the classes listed in Chapter 3."
                  ]
                },
                {
                  "type": "entries",
                  "page": 8,
                  "name": "Determining Your Ability Scores",
                  "entries": [
                    "The six abilities that are prevalent in every D&D campaign and determine your character's skills are: Strength, Dexterity, Constitution, Intelligence, Wisdom, and Charisma. When you calculate the number of each ability score, you will need to list them on your character sheet.",
                    "The Dungeons and Dragons 5th Editions rules should list how you can determine your Ability Scores. However, I will also explain this process here. Using the Standard Array method, you can take the numbers 15, 14, 13, 12, 10, 8 and assign each number to a different Ability Score.",
                    "You may also choose to Roll for your Ability Scores by rolling a {@dice d6} dice four times and recording the sum of the three highest rolls. Repeat this process five more times until you have written down six total sums. Then, allocate each of these six numbers to individual Ability Scores of your choice. As an example, you may end up with the six numbers 17, 11, 13, 9, 12, 14 after rolling. You might decide you want strength to be your highest Ability Score, so you would put 17 for your Strength Score. Then you would fill in your other Ability Scores accordingly.",
                    "Lastly, one other way you can decide Ability Scores is through using Point Buy. You can easily find a free Point Buy Caculator online. It is of course always up to the DM to decide what method is used to determine Ability Scores for the party. Once you have calculated your ability scores, you will make changes to them according to your racial feats.",
                    {
                      "type": "table",
                      "caption": "Ability Scores and Modifiers",
                      "colLabels": [
                        "Ability Score",
                        "Modifier"
                      ],
                      "colStyles": [
                        "col-6 text-center",
                        "col-6 text-center"
                      ],
                      "rows": [
                        [
                          "1",
                          "-5"
                        ],
                        [
                          "2-3",
                          "-4"
                        ],
                        [
                          "4-5",
                          "-3"
                        ],
                        [
                          "6-7",
                          "-2"
                        ],
                        [
                          "8-9",
                          "-1"
                        ],
                        [
                          "10-11",
                          "0"
                        ],
                        [
                          "12-13",
                          "+1"
                        ],
                        [
                          "14-15",
                          "+2"
                        ],
                        [
                          "16-17",
                          "+3"
                        ],
                        [
                          "18-19",
                          "+4"
                        ],
                        [
                          "20-21",
                          "+5"
                        ],
                        [
                          "22-23",
                          "+6"
                        ],
                        [
                          "24-25",
                          "+7"
                        ],
                        [
                          "26-27",
                          "+8"
                        ],
                        [
                          "28-29",
                          "+9"
                        ],
                        [
                          "30",
                          "+10"
                        ]
                      ]
                    },
                    {
                      "type": "entries",
                      "page": 9,
                      "name": "Beginning With a Devil Fruit, Haki, or Character Feat (Optional)",
                      "entries": [
                        "If your DM allows for it, your character might've already learned how to use basic haki, learned a character feat, or eaten a Devil Fruit prior to the start of their journey in this campaign. This would mean you gain a Haki ability or random Devil Fruit power at the very beginning of the adventure and cannot consume another Devil Fruit ever again. Of course, this also means you will never be able to swim again. This may make the start of the adventure far easier than normal, but things should even out in difficulty later on.",
                        "If you are able to use this rule and start with a Devil Fruit or Haki, you may roll on the \"Uncommon\" Devil Fruit Table in Chapter 7. Once you have rolled your power, you are stuck with it, good or bad. If you instead start with Haki, you gain an \"Uncommon\" Haki Advancement feat of your choice in Chapter 7. If you are starting at later levels or right on the grand line, your DM may allow you to roll on the \"Rare\" Devil Fruit table instead and choose up to a \"Rare\" Haki Advancement feat. Lastly, if neither Haki or a Devil Fruit fits your taste, you may start with a Character Feat in Chapter 6. This can technically be done at any point in character creation, but make sure you meet any prerequisites needed for advancements and feats. Make sure to write down the name and abilities of your Devil Fruit as well as your Haki abilities somewhere on your character sheet or use separate handout provided by your DM."
                      ]
                    },
                    {
                      "type": "entries",
                      "page": 9,
                      "name": "Describing Your Character",
                      "entries": [
                        "First, hopefully you've already decided on a name for your character. If not, try to think of something you like the sound of. If you can't think of anything, feel free to look up D&D name generators online. Then, start to really develop their personality and appearance in your head.",
                        "After you have a concept in mind, you want to start writing and organizing these ideas onto your character sheet. Try to find what Alignment best fits them and their morals. Then, start to think up some defining Personality Traits. Once your mark those down on your character sheet, start getting into their Ideals, Bonds, and Flaws. These will provide a guideline on how you plan on roleplaying and making decisions with your character.",
                        "Now you want to decide on your characters Background. Your background will provide you with tools and knowledge gained from how you've lived your life prior to the start of the campaign. This will affect how those who recognize you interact with you, how you're treated by the general public, and what your occupation is or was. A DM may provide you with custom backgrounds for this adventure, but feel free to choose from the ones listed in Chapter 4."
                      ]
                    },
                    {
                      "type": "entries",
                      "page": 9,
                      "name": "Race, Devil Fruit, and Ability Scores",
                      "entries": [
                        "It is important to take into consideration how your race and Ability Scores can impact your character's appearance and personality. Some One Piece races may be noticeably taller than others, some may be tinier on average, and some may have very distinguishable traits.",
                        "Additionally, if you are a Devil Fruit user, you may have certain physical features or personality traits that match the nature or properties of your power. For example, a user of the Moku Moku no mi (Smoke Logia) might be a huge chain smoker who tends to dress in white or gray colored clothing. A user of the Neko Neko no mi, Model: Lion (Zoan) could dress up in flashy golden clothing and consider themselves royalty. If your character ate a Devil Fruit before being introduced to the party, consider incorporating how you got the power and how it impacts your daily life into your background. It is up to you how you want to incorporate the theme of your Devil Fruit into your character.",
                        "Furthermore, your final ability scores may also factor into your appearance and attitude. Here are some examples:",
                        "A character with high strength may appear physically intimidating and bulky, with defined muscles and a towering figure. With low strength, they might appear scrawny or flabby.",
                        "A character with high dexterity may appear incredibly quick and versatile when moving around, with a potentially more lean appearance. With low dexterity, they may be heavier or move a bit slower than others.",
                        "A character with high constitution may appear noticeably healthy and sturdy. With low constitution, they may look a tad bit sickly or pale.",
                        "A character with high intelligence may appear more structured or knowledgeable when talking to others, perhaps having several books or scrolls in their possession. With low intelligence, they may speak noticeably slow, sometimes having a dumbfounded look on their face when hearing complicated explanations.",
                        "A character with high wisdom may appear more aware of their surroundings and have a grasp on the deeper meaning of interactions in their daily lives. With low wisdom, a character may seem aloof or carefree to others.",
                        "A character with high charisma will most likely stand out in public and most social situations, having the ability to influence the attitudes and thoughts of others through interacting with them. With low charisma, a character may be more easily ignored or feel slightly more difficult to agree with in conversations."
                      ]
                    },
                    {
                      "type": "entries",
                      "page": 9,
                      "name": "Getting Equipped",
                      "entries": [
                        "Class and background will typically decide what equipment your character starts with. Your equipment includes weapons, armor, tools, trinkets, clothing, and other gear. Look at Chapter 5 to record this information on your character sheet.",
                        "Alternatively, you may choose to purchase your starting equipment instead. You will start with a set number of Belly (฿) to spend on equipment, based on the value given to you by your class.",
                        "Further information on starting gold based on class is detailed in Chapter 5. Weapons in the One Piece world include various types of firearms such as pistols, rifles, and occasionally very high-tech weaponry such as laser beams. The most common weapons you will find are guns like flintlocks, and swords such as cutlasses and sabers. Much higher firepower weapons such as cannons are common, but are typically only used on ships or in fortresses.",
                        "Melee Weapons require that you roll a {@dice 1d20} and add your strength or dexterity modifier as well as your Proficiency Bonus to the roll to hit. This modifier is also usually added on top of the damage roll. Melee weapons tend to use strength modifiers, but occasionally allow you to use other modifiers depending on your weapon or class.",
                        "Ranged Weapons require that you roll a {@dice 1d20} and add your strength or dexterity modifier as well as your Proficiency Bonus to the roll to hit. This modifier is also usually added on top of the damage roll. Ranged weapons tend to use dexterity modifiers, but occasionally allow you to use other modifiers depending on your weapon or class.",
                        "Traditional armor is used far less in the One Piece world often due to how inconvenient it can be for mobility, but it can still be rarely utilized by very tanky pirates. For this reason, it might be wise to reflavor these items for certain characters by instead using durable clothing or body armor that can be used underneath clothing as a substitute. Shields are not used quite as often either, but can still be found and used by very defensive-style duelists.",
                        "Armor Class without armor is normally equal to 10 + Dexterity Modifier. Certain classes might change how this is calculated. Additionally, wearing armor or using shields will alter the Base or Modifier value of your AC.",
                        "Be sure to write down all of these values on your character sheet for easy access and to remember them for combat encounters."
                      ]
                    },
                    {
                      "type": "entries",
                      "page": 10,
                      "name": "Wrapping Up Session 0",
                      "entries": [
                        "If you are playing with a large group, it is sometimes a good idea to get everyone together a week or so before the first official campaign session to discuss character setup. This is usually called Session 0. With the help of your Dungeon Master and fellow players, try to decide how you want your characters to mesh together. Does everyone in the party/crew know each other before the campaign starts? Does your backstory include any of the other player characters or NPCs? How will your character's background and current occupation fit into the crew's goals and the story? These are all important questions to ask yourselves and especially the DM."
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "type": "section",
              "name": "1st level and beyond",
              "page": 10,
              "entries": [
                "By exploring the One Piece World and fighting your way through various forces, your characters will start to develop new strategies and grow stronger over time. Each time a major advancement occurs, either due to reaching a specific number of Experience Points or reaching a Milestone in the story, you will gain a Character Level.",
                "For example, if you start at level 1 with 0 Experience Points and gain enough experience over the course of a session to make your way to Level 2, you will mark this on your character sheet and upgrade your stats accordingly during your next Long Rest. Additionally, your DM may decide to use a Milestone system by granting you a level up upon reaching a new area or island, completing an important objective, or obtaining a key item or treasure.",
                {
                  "type": "table",
                  "colLabels": [
                    "Experience Points",
                    "Level",
                    "Proficiency Bonus"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-3 text-right",
                    "col-9 text-right"
                  ],
                  "rows": [
                    [
                      "0",
                      "1",
                      "+2"
                    ],
                    [
                      "300",
                      "2",
                      "+2"
                    ],
                    [
                      "900",
                      "3",
                      "+2"
                    ],
                    [
                      "2,700",
                      "4",
                      "+2"
                    ],
                    [
                      "6,500",
                      "5",
                      "+3"
                    ],
                    [
                      "14,000",
                      "6",
                      "+3"
                    ],
                    [
                      "23,000",
                      "7",
                      "+3"
                    ],
                    [
                      "34,000",
                      "8",
                      "+3"
                    ],
                    [
                      "48,000",
                      "9",
                      "+4"
                    ],
                    [
                      "64,000",
                      "10",
                      "+4"
                    ],
                    [
                      "85,000",
                      "11",
                      "+4"
                    ],
                    [
                      "100,000",
                      "12",
                      "+4"
                    ],
                    [
                      "120,000",
                      "13",
                      "+5"
                    ],
                    [
                      "140,000",
                      "14",
                      "+5"
                    ],
                    [
                      "165,000",
                      "15",
                      "+5"
                    ],
                    [
                      "195,000",
                      "16",
                      "+5"
                    ],
                    [
                      "225,000",
                      "17",
                      "+6"
                    ],
                    [
                      "265,000",
                      "18",
                      "+6"
                    ],
                    [
                      "305,000",
                      "19",
                      "+6"
                    ],
                    [
                      "355,000",
                      "20",
                      "+6"
                    ]
                  ]
                },
                {
                  "type": "entries",
                  "page": 11,
                  "name": "level tiers during the adventure",
                  "entries": [
                    "During the journey, the DM may decide to structure the pacing and level advancement throughout the adventure to give the feeling of progression to players. By deciding level tiers for certain areas in the world, it will be easy to balance enemies and NPCs in ways that align with player progression.",
                    "The first tier (levels 1-4) will be for very early exploration throughout the seas outside of the Grand Line, including the North Blue, East Blue, South Blue, and West Blue. It would be wise to start in one of these seas, preferably a fair distance away from Reverse Mountain and the Grand Line. Player characters will be fairly weak at this tier, and will only encounter minor enemies and challenges until they reach the Grand Line.",
                    "The second tier (levels 5-10) will be where most of the first half of the campaign takes place, in a portion of the Grand Line called \"Paradise\". This will be where many mid-tier pirates and powerful members of the navy reside. The sea and various islands will be difficult to traverse, with sea monsters and extreme weather conditions constantly bombarding your travel at random. Surviving to the end of Paradise should prove to be a challenge and feel like an amazing accomplishment upon completing the end. However, the next two stages should feel far more threatening.",
                    "The third tier (levels 11-15) is where players will start facing extremely overwhelming challenges. Making your way into the second half of the Grand Line, called the New World, the party should be facing unimaginably powerful pirate crews called the Yonko (or Four Emperors). The weather and islands here are even more threatening than the first half of the grand line, enough for a majority of crews to perish upon initially reaching this area. This will be the stage where characters start training, conducting espionage on the Yonko, and collecting Road Poneglyphs.",
                    "The final tier (levels 16-20) is the last stretch of the journey. At this legendary tier, characters should be able to stand up to Yonko pirate crews and marine admirals. Most fights will be overwhelmingly large-scale and epic, involving hundreds or thousands of pirates in huge wars and battles across the end of the New World. Once several Yonko have fallen and Road Poneglyphs are copied down, the crew can make their way to the One Piece to become pirate kings/queens and complete the adventure."
                  ]
                }
              ]
            }
          ]
        },
        {
          "type": "section",
          "name": "Races",
          "page": 12,
          "entries": [
            {
              "type": "image",
              "href": {
                "type": "external",
                "url": "https://i.imgur.com/8UP9POi.jpg"
              }
            },
            "The races in One Piece all have a variety of distinct traits that set them apart from one-another. While humans are the most common and reside on most islands, other demihuman races have their own islands and territories that they reside in around the world. These demihuman races also have a wide variety sizes, characteristics, abilities, and cultures. In many cases, non-human races can be seen as much stronger by default than ordinary humans. However, many humans may opt to regularly train to be on par with these races as well.",
            "Typically, non-human races don't mingle well with human civilzation and culture due to the severe level of racism and oppression often being brought non-humans by the Navy and World Government, which further fuels anti-human sentiments among the human populace. When a non-human is introduced into a human society, it will most likely be treated more harshly than their human counterpart, oftentimes alienating them completely. Likewise, Humans may also be treated differently when entering a non-human tribe or country due to the resentment they hold. It is up to the DM to decide how to run these encounters during roleplay.",
            "Remember, the One Piece world is very divided and has many themes of slavery and extreme hatred toward non-humans. If these themes are too extreme or uncomfortable to run, feel free to remove most of the racial tension for a more relaxed experience for non-human player characters.",
            {
              "type": "section",
              "name": "Player Races",
              "page": 12,
              "entries": [
                "When choosing a player character's race, it is important to choose an option that suits the character's personality, background, appearance, and perhaps even class and abilities. For example, a characer that loves to swim and interact with aquatic creatures may be best suited by picking the Fishman or Merfolk race. In order to properly make this choice, read each race option and consult with your DM for any questions or advice you may need.",
                "For the purposes of game balance, many races from the One Piece world will be restricted from players. While some may technically be listed below for more lenient DMs to allow, they are by no means on the same level as the rest of the included races in this section. Races that may break game balance or prove to be far too strong will be marked with the \"Optional\" tag.",
                {
                  "type": "inset",
                  "name": "Universal Language",
                  "entries": [
                    "You may notice the complete absence of spoken or written language traits available as you read through the below races.",
                    "Due to the One Piece world having few, if any, diverse languages spoken, even among other non-human races, it can be assumed that each humanoid creature shares a \"Common\" language in which they can all speak with individual literacy depending on the creature's intelligence."
                  ]
                }
              ]
            },
            {
              "type": "section",
              "name": "Human",
              "page": 10,
              "entries": [
                "In the world of One Piece, humans can be considered highly invasive and territorial to most other races and creatures. While there are many good-spirited humans out there, the World Government and Navy often tarnish the reputation of humans among non-humans. Due to this fact, most non-human races don't get along well with humans on average. However, there can very well be brotherhood among these races in certain circumstances, so long as compassion and friendship is shown.",
                "{@b Conquerors.} Humans will settle in and take control of just about anywhere they can reach. The exception to this rule may be places like Fish-man Island or Zou, which are too inconvenient and out-of-reach to settle on for most human civilizations. Most of the world is conquered and ruled by humans under the World Government.",
                "{@b Great Kingdoms.} As humans have expanded over the centuries, they have established many large cities, kingdoms, and fortresses across various islands and continents. Human culture can also be very different depending on where you look. While some human settlements can be more open-minded and accepting, other places may be far less tolerant toward outsiders and different ideas or cultures.",
                {
                  "type": "section",
                  "name": "Human Traits",
                  "page": 10,
                  "entries": [
                    "While many humans vary in shape and size, your human character will have these traits.",
                    "{@b Ability Score Increase.} Your ability scores each increase by 1.",
                    "{@b Age.} Humans reach adulthood in their teens and live for around a century.",
                    "{@b Alignment.} There is no clear alignment that is consistent among all humans. Just about any alignment can be justified.",
                    "{@b Size.} Humans in the One Piece World are typically 5-6 feet tall. Some can rest far outside this range, but your size will count as medium.",
                    "{@b Speed.} Your base walking speed is 30 feet.",
                    {
                      "type": "entries",
                      "name": "Human Variant Traits",
                      "entries": [
                        "Some humans can be noticeably different in their abilities and skills. For this reason, you may choose to instead replace the standard Human Ability Score Increase with these traits instead:",
                        "{@b Ability Score Increase.} Two different ability scores of your choice increase by 1.",
                        "{@b Skill.} You gain proficiency in one skill of your choice.",
                        "{@b Feat.} You gain one Character Feat of your choice that you meet the prerequisite for in Chapter 6. You may only choose a Haki-related feat if you receive DM permission"
                      ]
                    },
                    {
                      "type": "entries",
                      "name": "Human Giant Traits",
                      "entries": [
                        "Very rarely, some humans may grow to be astonishingly larger than most others in the One Piece world, sometimes even doubling the average human height and weight. If your human character happens to fall under this category, you may choose to replace the standard Human Ability Score Increase with these traits instead:",
                        "{@b Ability Score Increase.}You increase your Strength score by 2.",
                        "{@b Size.} Humans in the One Piece World are typically 5-6 feet tall. Some can rest far outside this range, but your size will count as medium.",
                        "{@b Natural Athlete.} You have proficiency in the {@skill Athletics} skill.",
                        "{@b Warrior Training.} You have proficiency with the Battleaxe, Handaxe, Light Hammer, Longsword, Club, and Spear.",
                        "{@b Giant's Endurance.} You can focus yourself to occasionally shrug off injury. When you take damage, you can use your reaction to roll a {@dice d12}. Add your Constitution modifier to the number rolled, and reduce the damage by that total. After you use this trait, you can't use it again until you finish a short or long rest.",
                        "{@b Powerful Build.} You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
                      ]
                    },
                    {
                      "type": "entries",
                      "name": "Kuja Traits",
                      "entries": [
                        "If your human character is female, you may choose to take this Kuja variant subrace. If you do so, you may choose to replace the standard Human Ability Score Increase with these traits instead:",
                        "{@b Ability Score Increase.} You increase your constitution, wisdom, or charisma score by 2.",
                        "{@b Skill.} You gain proficiency with longbows, shortbows, shortswords, and spears.",
                        "{@b Beginner Haki.} You can choose to take the Color of Armament Training feat if you meet the prerequisite."
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "type": "section",
              "name": "Fishman",
              "page": 14,
              "entries": [
                "Fishmen, along with Merfolk, are one of the two races of humanoids that inhabit the sea. Fishmen are a roughly equal mix of Human and Fish, with human-like appendages and faces crossed with sea creatures such as sharks, blowfish, and other fish. They also have gills between their shoulders and necks, as well as often having webbed hands. Some species of fish-men may have extra appendages depending what on what species of fish they represent.",
                "Fishmen have both lungs and gills, which allow them to breathe underwater and on land. Their webbed fingers and agile bodies allow them to move quickly in water for as long as they want. Some fishmen use their naturally strong bodies and unique features as a reason to believe they are superior to Humans. Despite these beliefs, fish-men often end up being the ones to become enslaved and oppressed by Humans, which drives their hatred for them even further. However, not all fish-men think this way and can actually get along well with humans as equals.",
                "{@b Hybrids.} Fishmen have the ability to interbreed with other races, much like other humanoid races. It is not impossible to find half-humna or half-giant fishmen in places such as the grand line. Furthermore, fishmen can have children with merfolk, resulting in either a fishman or merfolk child being born.",
                "{@b Oppressed.} Like other non-human races, fish-men are the victims of world-wide oppression by humans. Due to this, many fish-men stay within the confines of fish-man island and only occasionally leave. Some evil fish-men have opted to be pirates to seek revenge against humanity. Unfortunately, several also end up as slaves under the world government. Even on islands not directly under world government jurisdiction, humans still treat fish-men very unfairly. For this reason, playing a fish-man can prove very different when visiting various human-inhabited islands around the sea.",
                "{@b Domination.} Though they are often misunderstood, many fish-men do hold the belief that they should rule over all other fish in the sea. And due to the cruel treatment they receive from humans, some grow to also want to conquer and rule over humanity as a whole. This isn't true of all fish-men though, as many do exhibit the desire to co-exist with other races and species.",
                "{@b Extraordinary Strength.} As well as being born with bodies that provide natural weapons in battles, such as razor-sharp teeth, fish-men have incredibly strong bodies compared to average people. From birth, fish-men are ten times stronger than humans. Additionally, fish-men can be even more troublesome in underwater combat. Being even stronger underwater, they can easily devastate a human who isn't proficient at swimming. Unfortunately, this strength can be negated if a fish-man happens to be a Devil Fruit user.",
                {
                  "type": "section",
                  "name": "Fish-Man Traits",
                  "page": 14,
                  "entries": [
                    "Your fish-man character will have these traits.",
                    "{@b Ability Score Increase.} Your consitution score increases by 1.",
                    "{@b Age.} Fish-men reach adulthood in their teens and live for around a century.",
                    "{@b Alignment.} Most fish-men are lawful and many stay true to their values, though some lean toward being neutral. Fish-men can live in harmony with other sea creatures, but may turn violent against humans. For this reason, a fish-man can range from being good to evil.",
                    "{@b Size.} Fish-men are between 7 and 8 feet tall and weigh between 280 and 340 pounds on average. Your size is medium.",
                    "{@b Speed.} Your base walking speed is 30 feet, and you have a Swimming speed of 35 feet.",
                    "{@b Amphibious.} You can breath air and water.",
                    "{@b Underwater Athlete.} You have proficiency in the {@skill Athletics} skill. While underwater, you face no penalties or disadvantage as a result of underwater combat rules.",
                    "{@b Adapted to the Sea.} With the ability to adapt to extreme underwater depths, you have Resistance to cold damage."
                  ]
                },
                {
                  "type": "section",
                  "name": "Fish-Man Subraces",
                  "page": 15,
                  "entries": [
                    "Some races have subraces. Members of a subrace have the traits of the parent race in addition to the traits specified for their subrace. Relationships among subraces vary significantly from race to race and world to world.",
                    "{@b Subrace.} Breeding among fish-people resulted in three main subraces: Shark, Manta Ray, Octopus, or Smelt-Whiting variants. Choose one of these Subraces and add its traits to your racial features alongside the ones listed above.",
                    {
                      "type": "entries",
                      "name": "Shark Traits",
                      "entries": [
                        "These fish-men are known to have sharp shark-like teeth, light blue-tinted skin, large back fins, and extreme strength.",
                        "{@b Ability Score Increase.} Your Strength score increases by 2.",
                        "{@b Apex Predtaor.} You have proficiency in the {@skill Intimidation} skill.",
                        "{@b Bite.} Your razor-sharp teeth are a natural weapon, which you can use to make unarmed strikes. If you hit with it, you deal piercing damage equal to {@dice 1d6} + your Strength modifier, instead of the bludgeoning damage normal for an Unarmed Strike."
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "feat": [
    {
      "name": "Crew - Captain",
      "source": "D&DF-PHB",
      "prerequisite": [
        {
          "other": "Proficiency in {@skill Intimidation|PHB} and {@skill Persuasion|PHB}"
        }
      ],
      "entries": [
        "As the captain of your crew, you motivate, guide, and command those who sail under you. You are typically the strongest and most charismatic individual among them, and your goal is to unite your allies to overcome any obstacle.",
        "The captain should always have the final say in group decisions, providing leadership and direction to the crew.",
        {
          "type": "entries",
          "name": "Feature: Captain's Charisma",
          "entries": [
            "Your authority inspires natural respect. When you give an order to a willing ally, they feel compelled to follow it unless it goes directly against their ideals or alignment. This leadership should be used with wisdom, not tyranny."
          ]
        },
        {
          "type": "entries",
          "name": "Pirate Prestige Ability: Crew Recruitment",
          "entries": [
            "You can spend 1 pirate prestige point to recruit a hireling or specialist for a week without pay. After the week, they demand normal payment unless another point is spent.",
            "You cannot recruit in locations where your crew's reputation is 5 or lower."
          ]
        }
      ]
    },
    {
      "name": "Crew - Chef",
      "source": "D&DF-PHB",
      "prerequisite": [
        {
          "other": "Proficiency in {@skill Sleight of Hand|PHB} and {@skill Survival|PHB}, and with Cook's utensils"
        }
      ],
      "entries": [
        "As the ship's chef, you ensure the crew is well-fed and motivated. Your culinary skill keeps morale high and stomachs full, even through harsh seas.",
        {
          "type": "entries",
          "name": "Feature: Food Preparation",
          "entries": [
            "You can prepare treats during a long rest equal to your proficiency bonus. These treats last 8 hours, and a creature can eat one as a bonus action to gain temporary hit points equal to your proficiency bonus."
          ]
        },
        {
          "type": "entries",
          "name": "Pirate Prestige Ability: First-Class Feast",
          "entries": [
            "As part of a short rest, you can spend 1 pirate prestige point to cook a feast. Any creature that eats your food and spends Hit Dice regains an additional 1d8 hit points."
          ]
        }
      ]
    },
    {
      "name": "Crew - Doctor",
      "source": "D&DF-PHB",
      "prerequisite": [
        {
          "other": "Proficiency in {@skill Medicine|PHB},   Herbalism kit, Brewer's supplies, or Alchemist's supplies"
        }
      ],
      "entries": [
        "You are responsible for the health and safety of your crewmates, treating injuries and diseases aboard the ship.",
        {
          "type": "entries",
          "name": "Feature: Advanced Treatment",
          "entries": [
            "When you use a healer's kit to stabilize a dying creature, it regains 1 hit point. You can also spend ฿400,000 in supplies over 1 hour to end disease, blindness, deafness, paralysis, or poison on a creature."
          ]
        },
        {
          "type": "entries",
          "name": "Pirate Prestige Ability: First Aid",
          "entries": [
            "You can spend 1 pirate prestige point as an action to restore 1d6 + 4 hit points to a creature, plus hit points equal to their maximum Hit Dice. They cannot benefit again until a short or long rest."
          ]
        }
      ]
    },
    {
      "name": "Crew - Helmsman",
      "source": "D&DF-PHB",
      "prerequisite": [
        {
          "other": "Proficiency in {@skill Perception|PHB}, {@skill Survival|PHB}, and Vehicles (water)"
        }
      ],
      "entries": [
        "You are responsible for steering and maneuvering the ship through rough waters and dangerous conditions.",
        {
          "type": "entries",
          "name": "Feature: Through Thick and Thin",
          "entries": [
            "You add your proficiency bonus to checks made to steer the ship or avoid hazards, even if already proficient."
          ]
        },
        {
          "type": "entries",
          "name": "Pirate Prestige Ability: At the Helm",
          "entries": [
            "When the ship or crew is targeted by an attack or effect, you can spend 1 pirate prestige point as a reaction to grant +2 to the ship's AC and to all crew members' AC and saving throws until the start of your next turn."
          ]
        }
      ]
    },
    {
      "name": "Crew - Lookout",
      "source": "D&DF-PHB",
      "prerequisite": [
        {
          "other": "Proficiency in {@skill Insight|PHB} and {@skill Perception|PHB}"
        }
      ],
      "entries": [
        "You are the ship's eyes, scanning the horizon for islands, ships, or danger.",
        {
          "type": "entries",
          "name": "Feature: Bird's Eye View",
          "entries": [
            "You can treat lightly obscured conditions (fog, rain, etc.) as clear when spotting ships or landmarks ahead."
          ]
        },
        {
          "type": "entries",
          "name": "Pirate Prestige Ability: Sharp-Sighted Scout",
          "entries": [
            "You can spend 1 pirate prestige point to make a Perception check with advantage, or gain +5 to passive Perception for 1 minute."
          ]
        }
      ]
    },
    {
      "name": "Crew - Musician",
      "source": "D&DF-PHB",
      "prerequisite": [
        {
          "other": "Proficiency in {@skill Performance|PHB} and {@skill Persuasion|PHB}"
        }
      ],
      "entries": [
        "You raise the crew's spirits with music and charisma, keeping morale strong during dark times.",
        {
          "type": "entries",
          "name": "Feature: Musical Talent",
          "entries": [
            "You can play or sing with skill, inspiring the crew and boosting morale through your performances."
          ]
        },
        {
          "type": "entries",
          "name": "Pirate Prestige Ability: Song of Legends",
          "entries": [
            "You can spend 1 pirate prestige point to perform a legendary song that raises the crew's reputation by 1d4 in a location. You also gain +2 to Charisma checks when speaking with locals for 1 day after the performance."
          ]
        }
      ]
    },
    {
      "name": "Crew - Navigator",
      "source": "D&DF-PHB",
      "prerequisite": [
        {
          "other": "Proficiency in {@skill Nature|PHB} and {@skill Survival|PHB}, Cartographer's tools, and Navigator's tools"
        }
      ],
      "entries": [
        "You chart and guide your crew's course, ensuring the ship travels safely and efficiently across dangerous waters.",
        {
          "type": "entries",
          "name": "Feature: Charting and Mapping",
          "entries": [
            "You can create maps and assist the helmsman or captain with navigation. You gain advantage on checks to determine direction or predict weather patterns."
          ]
        },
        {
          "type": "entries",
          "name": "Pirate Prestige Ability: Storm Tracking",
          "entries": [
            "You can spend 1 pirate prestige point to steer clear of a dangerous storm or sea hazard entirely. Exceptionally dangerous weather may require more points."
          ]
        }
      ]
    },
    {
      "name": "Crew - Record-Keeper",
      "source": "D&DF-PHB",
      "prerequisite": [
        {
          "other": "Proficiency in {@skill History|PHB| } and {@skill Religion|PHB}"
        }
      ],
      "entries": [
        "You chronicle the ship's history, record its adventures, and analyze lore and knowledge gathered along the journey.",
        {
          "type": "entries",
          "name": "Feature: Librarian of the Sea",
          "entries": [
            "At the start of each session, you may recap previous events. You can add your proficiency bonus to Intelligence checks involving written or historical information."
          ]
        },
        {
          "type": "entries",
          "name": "Pirate Prestige Ability: Flash of Insight",
          "entries": [
            "Spend 1 pirate prestige point to uncover a major clue or insight about a puzzle, artifact, or writing, as determined by the DM."
          ]
        }
      ]
    },
    {
      "name": "Crew - Shipwright",
      "source": "D&DF-PHB",
      "prerequisite": [
        {
          "other": "Proficiency in {@skill Athletics|PHB},  Carpenter's tools, and Woodcarver's tools"
        }
      ],
      "entries": [
        "You build, repair, and upgrade ships, ensuring your vessel is always ready for battle or voyage.",
        {
          "type": "entries",
          "name": "Feature: Ship Building, Upgrading, and Repairing",
          "entries": [
            "You can reroll one failed roll during ship construction and only pay for materials, not labor. You are proficient in all ship maintenance tasks."
          ]
        },
        {
          "type": "entries",
          "name": "Pirate Prestige Ability: Defensive Coating",
          "entries": [
            "You can spend any number of pirate prestige points over an hour to grant the ship 10 temporary hit points per point spent. This coating lasts 7 days or until replaced."
          ]
        }
      ]
    }
  ],
  "race": [
    {
      "name": "Cyborg",
      "source": "D&DF-PHB",
      "page": "21",
      "ability": [
        {
          "con": 2,
          "choose": {
            "from": [
              "str",
              "dex",
              "cha",
              "int",
              "wis"
            ],
            "count": 1
          }
        }
      ],
      "size": [
        "M"
      ],
      "speed": 30,
      "traitTags": [
        "Amphibious",
        "Natural Armor",
        "Skill Proficiency",
        "Tool Proficiency"
      ],
      "resist": [
        "poison"
      ],
      "entries": [
        "Your cyborg will have these traits.",
        {
          "type": "entries",
          "name": "Ability Score Increase",
          "entries": [
            "Your Constitution score increases by 2, and one other ability score of your choice increases by 1."
          ]
        },
        {
          "type": "entries",
          "name": "Age",
          "entries": [
            "Depending on how much of their body has been modified, cyborgs may have longer lifespans compared to other races. In theory, they are should still remain mortal so long as parts of them still remain organic."
          ]
        },
        {
          "type": "entries",
          "name": "Alignment",
          "entries": [
            "It can be assumed that many cyborgs act Lawfully, but they can technically fall under any alignment."
          ]
        },
        {
          "type": "entries",
          "name": "Size",
          "entries": [
            "Cyborgs in the One Piece World are typically 5-6 feet tall. Some can rest far outside this range, but your size will count as medium."
          ]
        },
        {
          "type": "entries",
          "name": "Speed",
          "entries": [
            "Your base walking speed is 30 feet."
          ]
        },
        {
          "type": "entries",
          "name": "Steel Skin",
          "entries": [
            "Your body has a layer of defensive metal beneath or replacing your skin, which can be enhanced with armor:",
            "You gain a +1 bonus to Armor Class.",
            "To reinforce your metal skin, first you must disassemble a piece of mundane or magical armor. After doing so, you must spend an hour consistently incorporating these parts into your skin. Once you are finished, you gain the AC and bonuses of your chosen armor as if you were wearing it, as well as all of the side-effects of that armor. To remove this armor, you must spend an hour replacing it with artificial skin.",
            "This metal skin cannot be removed from your body against your will."
          ]
        },
        {
          "type": "entries",
          "name": "Robotic Resistance",
          "entries": [
            "You have advantage on Saving Throws against being Poisoned, and you have Resistance to poison damage."
          ]
        },
        {
          "type": "entries",
          "name": "Refueling",
          "entries": [
            "In place of eating food and drinking water each day, you must instead consume an equivalent amount of fuel to what a normal creature of your size would eat. The type of fuel you use can range from cola to gasoline (your choice), which costs roughly ฿5,000. Starvation rules apply to consuming fuel as they would with food for another race."
          ]
        },
        {
          "type": "entries",
          "name": "Maintenance",
          "entries": [
            "Instead of sleeping each day, you instead conduct maintenance on your body during a Long Rest. This includes oiling your joints, repairing any dents or broken parts, or fixing anything else you'd need to maintain. This takes at least six hours to complete. You are able to see and hear normally while you complete these tasks."
          ]
        },
        {
          "type": "entries",
          "name": "Cyborg Upgrades",
          "entries": [
            "You install a weapon or tool feature of your choice listed below into your body. Each time you level up, you can choose to completely replace one of these features with another one. At 5th level, you can install and use a second upgrade feature of your choice:",
            {
              "type": "list",
              "items": [
                "Flail Arm. When you make a unarmed strike or melee weapon attack on your turn that requires your arms to use, you can choose to extend its reach for that attack by 5 feet. You can only use this once on a single melee attack per turn.",
                "Flame Breath. You learn the {@spell Create Bonfire|PHB} cantrip, which you produce from your mouth. Constitution is your Spellcasting Ability for this Spell.",
                "Refrigerated Stomach. You may store up to 30 pounds of gear in your body, concealed and protected by your metallic flesh. This also acts to chill and preserve any food or fuel you may want to store.",
                "Air Blast. You learn the {@spell Thunder Clap|PHB} cantrip, which you produce from air emitted from your body. Constitution is your Spellcasting Ability for this Spell.",
                "Propeller Body Your limbs can rotate at extreme speeds in water, acting as a boat propeller. You gain a swimming speed of 25 feet.",
                "Centaur Form Using an action to morph your lower body into the form of a horse, your speed increases by 10 feet for one minute. Additionally, you have advantage on all Strength checks and you can allow a medium or smaller creature to use you as a mount for the duration. Once you use this feature, you cannot use it again until you complete a short or long rest.",
                "Shape-Memory Alloy Body. You gain one skill proficiency and one tool proficiency of your choice, which you can choose to swap out each time you level up.",
                "Arsenal Infusion. You can spend an hour incorporating a single weapon you are proficient with into your body. Upon doing so, you can use this weapon as you normally would. Additionally, this weapon cannot be taken or removed from your body against your will. You may spend an hour to remove this weapon from your body.",
                "Night Lens. You can see in {@quickref Vision and Light||2||dim light} within 60 feet of you as if it were {@quickref Vision and Light||2||bright light}, and in Darkness as if it were {@quickref Vision and Light||2||dim light}. You can't discern color in Darkness, only Shades of Gray.",
                "Headlights. Lights on your body emit {@quickref Vision and Light||2||bright light} in a 20-foot radius and {@quickref Vision and Light||2||dim light} for an additional 20 feet.",
                "Extended Flail. This is an upgrade of the Flail Arm Feature, meaning you must also have that upgrade learned in order to learn and use this one as well. Your Flail Arm reach extends to 10 feet.",
                "Flamethrower. This is an upgrade of the Flame Breath Feature, meaning you must also have that upgrade learned in order to learn and use this one as well. You learn the {@spell Burning Hands|PHB} spell cast at the 2nd-Level, which acts as a powerful spray of fire emitted from your body. Constitution is your Spellcasting Ability for this Spell. Once you use this feature, you cannot use it again until you complete a long rest.",
                "Radical Beam. This is an upgrade of the Air Blast Feature, meaning you must also have that upgrade learned in order to learn and use this one as well. You learn the {@spell Moonbeam|PHB} spell, which acts as a powerful explosive laser beam emitted from you body. Constitution is your Spellcasting Ability for this Spell. Once you use this feature, you cannot use it again until you complete a long rest.",
                "General Cannon. This is an upgrade of the Air Blast Feature, meaning you must also have that upgrade learned in order to learn and use this one as well. You learn the {@spell Shatter|PHB} spell, which you produce from air emitted from your body. Constitution is your Spellcasting Ability for this Spell. Once you use this feature, you cannot use it again until you complete a long rest.",
                "Larger Propellers. This is an upgrade of the Propeller Body Feature, meaning you must also have that upgrade learned in order to learn and use this one as well. You can now spin parts of your body like a propeller to lift you into the air. You now have a flying speed of 10 feet.",
                "General Form. This is an upgrade of the Centaur Form Feature, meaning you must also have that upgrade learned in order to learn and use this one as well. You can now transform your body into a larger robotic form until you run out of energy. You can cast the {@spell Enlarge/Reduce} spell on yourself once with this trait, using only the spell's enlarge option, appearing to transform into a larger metal version of yourself. You regain the ability to cast this spell with this trait when you finish a long rest.",
                "Advanced Shape-Memory Alloy. This is an upgrade of the Shape-Memory Alloy Body Feature, meaning you must also have that upgrade learned in order to learn and use this one as well. You learn an additional Skill of your choice. Additionally, you learn the Shield spell. Once you use this feature, you cannot use it again until you complete a long rest.",
                "Grand Arsenal. This is an upgrade of the Arsenal Infusion Feature, meaning you must also have that Upgrade learned in order to learn and use this one as well. You are able to implement one more weapon into your body using Arsenal Infusion."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Fish-Man",
      "source": "D&DF-PHB",
      "page": 15,
      "ability": [
        {
          "con": 1
        }
      ],
      "size": [
        "M"
      ],
      "traitTags": [
        "Amphibious",
        "Skill Proficiency"
      ],
      "resist": [
        "cold"
      ],
      "entries": [
        "Your fish-man character will have these traits.",
        {
          "type": "entries",
          "name": "Ability Score Increase",
          "entries": [
            "Your consitution score increases by 1."
          ]
        },
        {
          "type": "entries",
          "name": "Age",
          "entries": [
            "Fish-men reach adulthood in their teens and live for around a century."
          ]
        },
        {
          "type": "entries",
          "name": "Alignment",
          "entries": [
            "Most fish-men are lawful and many stay true to their values, though some lean toward being neutral. Fish-men can live in harmony with other sea creatures, but may turn violent against humans. For this reason, a fish-man can range from being good to evil."
          ]
        },
        {
          "type": "entries",
          "name": "Size",
          "entries": [
            "Fish-men are between 7 and 8 feet tall and weigh between 280 and 340 pounds on average. Your size is medium."
          ]
        },
        {
          "type": "entries",
          "name": "Speed",
          "entries": [
            "Your base walking speed is 30 feet, and you have a Swimming speed of 35 feet."
          ]
        },
        {
          "type": "entries",
          "name": "Amphibious",
          "entries": [
            "You can breathe air and water."
          ]
        },
        {
          "type": "entries",
          "name": "Underwater Athlete",
          "entries": [
            "You have proficiency in the {@skill Athletics} skill. While underwater, you face no penalties or disadvantage as a result of underwater combat rules."
          ]
        },
        {
          "type": "entries",
          "name": "Adapted to the Sea",
          "entries": [
            "With the ability to adapt to extreme underwater depths, you have Resistance to cold damage."
          ]
        }
      ],
      "subraces": [
        {
          "name": "Shark Trait",
          "source": "D&DF-PHB",
          "raceName": "Fish-Man",
          "raceSource": "D&DF-PHB",
          "ability": [
            {
              "str": 2
            }
          ],
          "entries": [
            "These fish-men are known to have sharp shark-like teeth, light blue-tinted skin, large back fins, and extreme strength.",
            {
              "type": "entries",
              "name": "Ability Score Increase",
              "entries": [
                "Your Strength score increases by 2."
              ]
            },
            {
              "type": "entries",
              "name": "Apex Predator",
              "entries": [
                "Apex Predtaor You have proficiency in the {@skill Intimidation} skill."
              ]
            },
            {
              "type": "entries",
              "name": "Bite",
              "entries": [
                "Your razor-sharp teeth are a natural weapon, which you can use to make unarmed strikes. If you hit with it, you deal piercing damage equal to {@dice 1d6} + your Strength modifier, instead of the bludgeoning damage normal for an Unarmed Strike."
              ]
            }
          ]
        },
        {
          "name": "Manta Ray Traits",
          "source": "D&DF-PHB",
          "raceName": "Fish-Man",
          "raceSource": "D&DF-PHB",
          "ability": [
            {
              "dex": 2
            }
          ],
          "entries": [
            "These fish-men are known to have wide side-fins and light-blue skin, moving at high speeds underwater.",
            {
              "type": "entries",
              "name": "Ability Score Increase",
              "entries": [
                "Your Dexterity score increases by 2."
              ]
            },
            {
              "type": "entries",
              "name": "Underwater Acrobatics",
              "entries": [
                "Underwater {@skill Acrobatics} You gain proficiency in the {@skill Acrobatics} skill. You have advantage on acrobatics check made while underwater."
              ]
            },
            {
              "type": "entries",
              "name": "Sea Glide",
              "entries": [
                "You have a Swimming speed of 40 feet"
              ]
            }
          ]
        },
        {
          "name": "Octopus Traits",
          "source": "D&DF-PHB",
          "raceName": "Fish-Man",
          "raceSource": "D&DF-PHB",
          "traitTags": [
            "Tool Proficiency"
          ],
          "ability": [
            {
              "dex": 1,
              "str": 1
            }
          ],
          "entries": [
            "These fish-men are known to have wide side-fins and light-blue skin, moving at high speeds underwater.",
            {
              "type": "entries",
              "name": "Ability Score Increase",
              "entries": [
                "Your Strength and Dexterity scores both increase by 1."
              ]
            },
            {
              "type": "entries",
              "name": "Deadly Precision",
              "entries": [
                "Deadly Precision You gain proficiency in one of the following: sleight of hand or an Artisan's tool of your choice."
              ]
            },
            {
              "type": "entries",
              "name": "Multi-Armed",
              "entries": [
                "You have four additional arms, six in total. While you cannot efficiently wield weapons with these arms, you may use them to hold smaller items such as potions and trinkets. Additionally, you have advantage on grapple checks with your arms."
              ]
            }
          ]
        },
        {
          "name": "Smelt-Whiting Traits",
          "source": "D&DF-PHB",
          "raceName": "Fish-Man",
          "raceSource": "D&DF-PHB",
          "traitTags": [
            "Amphibious",
            "Skill Proficiency"
          ],
          "ability": [
            {
              "cha": 2
            }
          ],
          "entries": [
            "Smelt-whiting fish-men are known to have more dominant fish-like characteristics compared to other fish-men, and can spit water at their enemies.",
            {
              "type": "entries",
              "name": "Ability Score Increase",
              "entries": [
                "Your Charisma score increases by 2."
              ]
            },
            {
              "type": "entries",
              "name": "Big-Mouthed",
              "entries": [
                "You gain proficiency in the {@skill Deception} or {@skill Persuasion} skill (your choice).",
                "Hydro Cannon You have the natural ability to shoot concentrated blasts of water out of your mouth. You can cast {@spell ray of frost} with this trait. Starting at 3rd Level, you can cast {@spell Ice Knife|XGE} with it. Once you Cast a Spell with this trait, you can't cast that spell with it again until you finish a Long Rest. Charisma is your Spellcasting Ability for these Spells"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Merfolk",
      "source": "D&DF-PHB",
      "page": 16,
      "size": "M",
      "ability": [
        {
          "cha": 1,
          "dex": 1,
          "wis": 1
        }
      ],
      "speed": [],
      "traitTags": [
        "Amphibious"
      ],
      "languageProficiencies": [
        {
          "other": true
        }
      ],
      "resist": [
        "cold"
      ],
      "entries": [
        "Your merfolk character will have these traits.",
        {
          "type": "entries",
          "name": "Ability Score Increase",
          "entries": [
            "Your Dexterity, Wisdom, and Charisma scores each increase by 1."
          ]
        },
        {
          "type": "entries",
          "name": "Age",
          "entries": [
            "Merfolk reach adulthood in their teens, mature considerably in their 30s, and live for around a century."
          ]
        },
        {
          "type": "entries",
          "name": "Alignment",
          "entries": [
            "Most merfolk are neutral or lawful good. However, few may turn violent against humans and become evil. They are rarely chaotic in nature."
          ]
        },
        {
          "type": "entries",
          "name": "Size",
          "entries": [
            "Merfolk are between 6 and 7 feet long and weigh between 160 and 240 pounds on average. Your size is medium."
          ]
        },
        {
          "type": "entries",
          "name": "Speed",
          "entries": [
            "Your base walking speed is 10 feet, and you have a Swimming speed of 50 feet. Once you reach age 30 as a female, your walking speed becomes 30 feet."
          ]
        },
        {
          "type": "entries",
          "name": "Amphibious",
          "entries": [
            "You can breathe air and water."
          ]
        },
        {
          "type": "entries",
          "name": "Merfolk Training⁠",
          "entries": [
            "You have proficiency with the spear, Trident, and net."
          ]
        },
        {
          "type": "entries",
          "name": "Merfolk Combat",
          "entries": [
            "Being trained in underwater combat, you can control the flow of water to attack your enemies (ice and cold damage is treated as water). You can cast {@spell Ray of Frost} with this trait. Starting at 3rd Level, you can cast {@spell Ice Knife|XGE} with it, and starting at 5th Level, you can also cast {@spell Rime's Binding Ice|FTD} with it. Once you Cast a Spell with this trait, you can't cast that spell with it again until you finish a Long Rest. Charisma is your Spellcasting Ability for these Spells."
          ]
        },
        {
          "type": "entries",
          "name": "Adapted to the Sea",
          "entries": [
            "With the ability to adapt to extreme underwater depths, you have Resistance to cold damage."
          ]
        },
        {
          "type": "entries",
          "name": "Languages",
          "entries": [
            "Merfolk can all speak and understand the universal spoken language of this world. Additionally, using gestures and sounds, you can communicate simple ideas with any beast that has an innate Swimming speed."
          ]
        }
      ]
    },
    {
      "name": "Sky Islander",
      "source": "D&DF-PHB",
      "page": 17,
      "ability": [
        {
          "dex": 1
        }
      ],
      "speed": 30,
      "size": "M",
      "entries": [
        "Your sky islander will have these traits.",
        {
          "type": "entries",
          "name": "Ability Score Increase",
          "entries": [
            "Your Dexterity score increases by 1."
          ]
        },
        {
          "type": "entries",
          "name": "Age",
          "entries": [
            "Sky islanders reach adulthood in their teens and live for around a century."
          ]
        },
        {
          "type": "entries",
          "name": "Alignment",
          "entries": [
            "Sky islanders vary in alignment, ranging from good to evil, lawful to chaotic, but are typically neutral in some way."
          ]
        },
        {
          "type": "entries",
          "name": "Size",
          "entries": [
            "Sky islanders in the One Piece World are typically 5-6 feet tall. Some can rest far outside this range, but your size will count as medium."
          ]
        },
        {
          "type": "entries",
          "name": "Speed",
          "entries": [
            "Your base walking speed is 30 feet."
          ]
        },
        {
          "type": "entries",
          "name": "Protection of the Clouds",
          "entries": [
            "You are able to form fluffy floating clouds around you to reduce the speed of your fall. You gain the ability to cast {@spell Feather Fall}. Once you use this ability, you cannot use it again until you complete a Short or Long rest."
          ]
        },
        {
          "type": "entries",
          "name": "Dial Proficiency",
          "entries": [
            "You innately understand dials that have came from sky islands and can carry one with you. Roll once on the Simple Dial Table in Chapter 5 to determine which one you start with."
          ]
        },
        {
          "type": "entries",
          "name": "Languages",
          "entries": [
            "Sky islanders can all speak and understand the universal spoken language of this world."
          ]
        }
      ],
      "subraces": [
        {
          "name": "Shandian",
          "source": "D&DF-PHB",
          "raceName": "Sky Islander",
          "raceSource": "D&DF-PHB",
          "weaponProficiencies": [
            {
              "quarterstaff": true,
              "halberd": true,
              "pike": true,
              "glaive": true,
              "spear": true,
              "firearms": true
            }
          ],
          "ability": [
            {
              "str": 2
            }
          ],
          "entries": [
            "Your Shandian heritage has gifted you with great strength and combat expertise.",
            {
              "type": "entries",
              "name": "Ability Score Increase",
              "entries": [
                "Your Strength score increases by 2."
              ]
            },
            {
              "type": "entries",
              "name": "Shandian Weapon Training",
              "entries": [
                "You have proficiency with the quarterstaff, halberd, pike, glaive, spear, and heavy firearms."
              ]
            }
          ]
        },
        {
          "name": "Berkians",
          "source": "D&DF-PHB",
          "raceName": "Sky Islander",
          "raceSource": "D&DF-PHB",
          "ability": [
            {
              "wis": 2
            }
          ],
          "entries": [
            "Your Birkan heritage has gifted you with powerful observation and foresight through mantra.",
            {
              "type": "entries",
              "name": "Ability Score Increase",
              "entries": [
                "Your Wisdom score increases by 2."
              ]
            },
            {
              "type": "entries",
              "name": "Mantra Specialist",
              "entries": [
                "You can choose to take the Color of Observation Training feat if you meet the prerequisite."
              ]
            }
          ]
        },
        {
          "name": "Skypeans",
          "source": "D&DF-PHB",
          "raceName": "Sky Islander",
          "raceSource": "D&DF-PHB",
          "ability": [
            {
              "int": 2
            }
          ],
          "entries": [
            "Your Skypiean heritage has gifted you with great knowledge of dials.",
            {
              "type": "entries",
              "name": "Ability Score Increase",
              "entries": [
                "Your Intelligence score increases by 2."
              ]
            },
            {
              "type": "entries",
              "name": "Advanced Dial Proficiency",
              "entries": [
                "You start with an additional Dial, allowing you to roll once more on the {@table Simple Dial|D&DF-PHB} Table to determine what other Dial you start with. Additionally, you gain advantage on all checks made to find a dial."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Mink",
      "source": "D&DF-PHB",
      "page": 15,
      "ability": [
        {
          "str": 1,
          "dex": 1,
          "wis": 1
        }
      ],
      "size": "M",
      "speed": 30,
      "traitTags": [
        "Natural Weapon",
        "Skill Proficiency"
      ],
      "resist": [
        "lightning"
      ],
      "entries": [
        "Your mink will have these traits.",
        {
          "type": "entries",
          "name": "Ability Score Increase",
          "entries": [
            "Your Strength, Dexterity, and Wisdom scores each increase by 1."
          ]
        },
        {
          "type": "entries",
          "name": "Age",
          "entries": [
            "Minks reach adulthood in their teens and live for around a century."
          ]
        },
        {
          "type": "entries",
          "name": "Alignment",
          "entries": [
            "Most minks are neutral or lawful good. However, few may turn chaotic and give into their primal urges if exposed to the full moon for long enough."
          ]
        },
        {
          "type": "entries",
          "name": "Size",
          "entries": [
            "Minks in the One Piece World are typically 5-6 feet tall. Some can rest far outside this range, but your size will count as medium."
          ]
        },
        {
          "type": "entries",
          "name": "Speed",
          "entries": [
            "Your base walking speed is 30 feet."
          ]
        },
        {
          "type": "entries",
          "name": "Darkvision",
          "entries": [
            "You have an animal's keen Senses, especially in the dark. You can see in {@quickref Vision and Light||2||dim light} within 60 feet of you as if it were {@quickref Vision and Light||2||bright light}, and in Darkness as if it were {@quickref Vision and Light||2||dim light}. You can't discern color in Darkness, only Shades of Gray."
          ]
        },
        {
          "type": "entries",
          "name": "Beast's Slash",
          "entries": [
            "Because of your beast-like features, you have a climbing speed of 20 feet. In addition, your body is a natural Weapon, which you can use to make unarmed strikes. You can choose to deal slashing for your unarmed strikes, and your unarmed strike damage dice becomes a minimum of {@dice 1d6}."
          ]
        },
        {
          "type": "entries",
          "name": "Animal Instinct",
          "entries": [
            "You have proficiency in the {@skill Perception} and {@skill Stealth} Skills."
          ]
        },
        {
          "type": "entries",
          "name": "Electro",
          "entries": [
            "You know the {@spell Shocking Grasp|PHB} cantrip. Wisdom is your Spellcasting Ability for this Spell. Additionally, you are Resistant to lightning damage."
          ]
        },
        {
          "type": "entries",
          "name": "Sulong Transformation",
          "entries": [
            "Starting at 3rd Level, you can use your action to channel moonlight energy into your body and transform into a powerful bright white primal form with longer hair and enhanced size, bolstering your strength, speed, and electro.",
            "Your transformation lasts for 1 minute or until you end it as a Bonus Action. During it, your speed increases by 10 feet, you have advantage on strength checks, and once on each of your turns, you can deal extra electric damage to one target when you deal damage to it with an {@action Attack} or a spell. The extra electric damage equals your level.",
            "Once you use this trait, you can't use it again until you finish a Long Rest."
          ]
        }
      ]
    },
    {
      "name": "Yokai Tribesman",
      "source": "D&DF-PHB",
      "page": 20,
      "ability": [
        {
          "cha": 1
        }
      ],
      "size": "M",
      "speed": 30,
      "traitTags": [
        "Skill Proficiency",
        "Tool Proficiency"
      ],
      "entries": [
        "Your yokai tribesman will have these traits.",
        {
          "type": "entries",
          "name": "Ability Score Increase",
          "entries": [
            "Your Charisma score increases by 1."
          ]
        },
        {
          "type": "entries",
          "name": "Age",
          "entries": [
            "Yokai Tribesmen reach adulthood in their teens and live for around a century."
          ]
        },
        {
          "type": "entries",
          "name": "Alignment",
          "entries": [
            "Yokai Tribesmen display various alignments, but many are seen as evil. However, any alignment can be reasonably chosen."
          ]
        },
        {
          "type": "entries",
          "name": "Tribal Charisma",
          "entries": [
            "The pride of your race and features has made you unbelievably confident in conversations. You have proficiency in the {@skill Intimidation} and {@skill Persuasion} skills."
          ]
        },
        {
          "type": "entries",
          "name": "Crafty",
          "entries": [
            "You gain proficiency in one tool or instrument of your choice."
          ]
        }
      ],
      "subraces": [
        {
          "name": "Longleg Tribesman",
          "source": "D&DF-PHB",
          "raceName": "Yokai Tribesman",
          "raceSource": "D&DF-PHB",
          "speed": 35,
          "ability": [
            {
              "dex": 2
            }
          ],
          "overwrite": {
            "speed": 35
          },
          "entries": [
            "Your longleg tribesman has been gifted with magnificent long legs that grant them the following traits.",
            {
              "type": "entries",
              "name": "Ability Score Increase",
              "entries": [
                "Your Dexterity score increases by 2."
              ]
            },
            {
              "type": "entries",
              "name": "Size",
              "entries": [
                "Longleg tribesmen in the One Piece World are typically 7-8 feet tall. Some can rest far outside this range, but your size will count as medium."
              ]
            },
            {
              "type": "entries",
              "name": "Speed",
              "entries": [
                "Your base walking speed is 35 feet."
              ]
            },
            {
              "type": "entries",
              "name": "Longleg Stride",
              "entries": [
                "Your massive legs allow you to move with a burst of speed. When you move on Your Turn in Combat, you can double your speed until the end of the turn. Once you use this trait, you can't use it again until you move 0 feet on one of your turns."
              ]
            }
          ]
        },
        {
          "name": "Longarm Tribesman",
          "source": "D&DF-PHB",
          "raceName": "Yokai Tribesman",
          "raceSource": "D&DF-PHB",
          "ability": [
            {
              "str": 2
            }
          ],
          "traitTags": [
            "Powerful Build"
          ],
          "entries": [
            "Your longarm tribesman has been gifted with long and lanky arms that grant immense strength and reach.",
            {
              "type": "entries",
              "name": "Ability Score Increase",
              "entries": [
                "Your Strength score increases by 2."
              ]
            },
            {
              "type": "entries",
              "name": "Size",
              "entries": [
                "Longarm tribesmen in the One Piece World are typically 5-6 feet tall. Some can rest far outside this range, but your size will count as medium."
              ]
            },
            {
              "type": "entries",
              "name": "Speed",
              "entries": [
                "Your base walking speed is 30 feet."
              ]
            },
            {
              "type": "entries",
              "name": "Long-Limbed",
              "entries": [
                "When you make a melee {@action Attack} on Your Turn, your reach for it is 5 feet greater than normal."
              ]
            },
            {
              "type": "entries",
              "name": "Powerful Build",
              "entries": [
                "You count as one size larger when determining your carrying Capacity and the weight you can push, drag, or lift."
              ]
            }
          ]
        },
        {
          "name": "Snakeneck Tribesman",
          "source": "D&DF-PHB",
          "raceName": "Yokai Tribesman",
          "raceSource": "D&DF-PHB",
          "ability": [
            {
              "int": 2
            }
          ],
          "traitTags": [
            "Skill Proficiency"
          ],
          "entries": [
            {
              "type": "entries",
              "name": "Ability Score Increase",
              "entries": [
                "Your Intelligence score increases by 2."
              ]
            },
            {
              "type": "entries",
              "name": "Size",
              "entries": [
                "Snakeneck tribesmen in the One Piece World are typically 6-8 feet tall due to their long neck. Some can rest far outside this range, but your size will count as medium."
              ]
            },
            {
              "type": "entries",
              "name": "Speed",
              "entries": [
                "Your base walking speed is 30 feet."
              ]
            },
            {
              "type": "entries",
              "name": "Quick Reflexes",
              "entries": [
                "You can add your proficiency bonus to your initiative rolls."
              ]
            },
            {
              "type": "entries",
              "name": "Serpentine Senses",
              "entries": [
                "You have proficiency in the {@skill Perception} skill."
              ]
            }
          ]
        },
        {
          "name": "Three-Eyed Tribesman",
          "source": "D&DF-PHB",
          "raceName": "Yokai Tribesman",
          "raceSource": "D&DF-PHB",
          "ability": [
            {
              "wis": 2
            }
          ],
          "traitTags": [
            "Blindsight"
          ],
          "entries": [
            "Your three-eyed tribesman is gifted with a third eye on the center of their forehead which grants them mysterious powers.",
            {
              "type": "entries",
              "name": "Ability Score Increase",
              "entries": [
                "Your Wisdom score increases by 2."
              ]
            },
            {
              "type": "entries",
              "name": "Size",
              "entries": [
                "Three-eyed tribesmen in the One Piece World are typically 5-6 feet tall. Some can rest far outside this range, but your size will count as medium."
              ]
            },
            {
              "type": "entries",
              "name": "Speed",
              "entries": [
                "Your base walking speed is 30 feet."
              ]
            },
            {
              "type": "entries",
              "name": "Darkvision",
              "entries": [
                "You can see in {@quickref Vision and Light||2||dim light} within 60 feet of you as if it were {@quickref Vision and Light||2||bright light}, and in Darkness as if it were {@quickref Vision and Light||2||dim light}. You can't discern color in Darkness, only Shades of Gray."
              ]
            },
            {
              "type": "entries",
              "name": "All-Seeing",
              "entries": [
                "You have {@sense blindsight} with a range of 10 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're {@condition blinded} or in darkness."
              ]
            },
            {
              "type": "entries",
              "name": "Third Eye (Optional)",
              "entries": [
                "Three-eyed tribesmen can all speak and understand the universal spoken language of this world. Additionally, some can awaken their third eye to be able to read and understand the language of the Poneglyphs (up to DM discretion)."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Dwarf ",
      "source": "D&DF-PHB",
      "page": 23,
      "ability": [
        {
          "Dex": 1
        }
      ],
      "size": [
        "T"
      ],
      "speed": 30,
      "entries": [
        "Your dwarf will have these traits",
        {
          "type": "entries",
          "name": "Ability Score Increase",
          "entries": [
            "Your Dexterity score increases by 1."
          ]
        },
        {
          "type": "entries",
          "name": "Age",
          "entries": [
            "Dwarves reach adulthood in their teens and live for around a century."
          ]
        },
        {
          "type": "entries",
          "name": "Alignment",
          "entries": [
            "Dwarves are typically Lawful Good, though they may sometimes fall under different alignments."
          ]
        },
        {
          "type": "entries",
          "name": "Speed",
          "entries": [
            "Your base walking speed is 30 feet."
          ]
        }
      ],
      "subraces": [
        {
          "name": "Tontatta Tribe",
          "source": "D&DF-PHB",
          "raceName": "Dwarf",
          "raceSource": "D&DF-PHB",
          "ability": [
            {
              "str": 2
            }
          ],
          "traitTags": [
            "Skill Proficiency"
          ],
          "resist": [
            "poison"
          ],
          "entries": [
            "Your tontatta tribesman has been granted supernatural agility, strength, and mastery over cultivating plants.",
            {
              "type": "entries",
              "name": "Ability Score Increase",
              "entries": [
                "Your Strength score increases by 2."
              ]
            },
            {
              "type": "entries",
              "name": "Size",
              "entries": [
                "Dwarves in the One Piece World are typically 6-12 inches tall. Your size is tiny."
              ]
            },
            {
              "type": "entries",
              "name": "Hard to Detect",
              "entries": [
                "Your tiny size and evasiveness gives you proficiency in the {@skill Stealth} and {@skill Acrobatics} skills.",
                "Glass Cannon Your hit point maximum decreases by 1, and it decreases by 1 every time you gain a level."
              ]
            },
            {
              "type": "entries",
              "name": "Super Strength",
              "entries": [
                "You are considered medium size when calculating push, pull, drag, or carry weight. You also roll normally on grapple checks and saves."
              ]
            },
            {
              "type": "entries",
              "name": "Swift Fury",
              "entries": [
                "When you reach 3rd level, you can cast the {@spell Zephyr Strike|XGE} spell as a 1st-level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the {@spell Kinetic Jaunt|SCC} spell once with this trait and regain the ability to do so when you finish a long rest."
              ]
            },
            {
              "type": "entries",
              "name": "Master Cultivators",
              "entries": [
                "Your mastery of plants and plant products grants you resistance to poison damage and immunity to the Poisoned condition."
              ]
            }
          ]
        },
        {
          "name": "Automata",
          "source": "D&DF-PHB",
          "raceName": "Dwarf",
          "raceSource": "D&DF-PHB",
          "ability": [
            {
              "con": 2
            }
          ],
          "traitTags": [
            "Amphibious",
            "Natural Armor",
            "Skill Proficiency"
          ],
          "resist": [
            "poison"
          ],
          "immune": [
            "lightning"
          ],
          "conditionImmune": [
            "disease"
          ],
          "entries": [
            "Your automata is a race of robots that resemble dwarves and have the ability to travel through outer space and live on the moon.",
            {
              "type": "entries",
              "name": "Ability Score Increase",
              "entries": [
                "Your Constitution score increases by 2."
              ]
            },
            {
              "type": "entries",
              "name": "Size",
              "entries": [
                "Automata are between 3 and 4 feet tall. Your size is small."
              ]
            },
            {
              "type": "entries",
              "name": "Programmed Minds",
              "entries": [
                "You are immune to abilities that allow other creatures to read your thoughts."
              ]
            },
            {
              "type": "entries",
              "name": "Robotic Resilience",
              "entries": [
                "You were created to have remarkable Fortitude, represented by the following benefits:",
                "You have advantage on Saving Throws against being Poisoned, and you have Resistance to poison damage.",
                "You don't need to eat, drink, or breathe.",
                "You are immune to disease.",
                "You don't need to sleep, and magic can't put you to sleep."
              ]
            },
            {
              "type": "entries",
              "name": "Militaristic Design",
              "entries": [
                "You gain one skill proficiency and one weapon proficiency of your choice."
              ]
            },
            {
              "type": "entries",
              "name": "Electric-Powered",
              "entries": [
                "You are immune to lightning damage. Additionally, if you are hit by an ability that would deal lightning damage, your attack rolls have advantage until the end of your next turn"
              ]
            },
            {
              "type": "entries",
              "name": "Iron Shell",
              "entries": [
                "Your metallic body grants you a +1 bonus to Armor Class."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Lunarian",
      "source": "D&DF-PHB",
      "page": 24,
      "ability": [
        {
          "dex": 2,
          "con": 1
        }
      ],
      "size": "M",
      "speed": 25,
      "resist": [
        "fire"
      ],
      "entries": [
        "Your lunarian will have these traits",
        {
          "type": "entries",
          "name": "Ability Score Increase",
          "entries": [
            "Your Dexterity score increases by 2, and your Constitution score increases by 1."
          ]
        },
        {
          "type": "entries",
          "name": "Age",
          "entries": [
            "Lunarians live for an unknown period of time, but it can be assumed that they reach adulthood in their teens and live for around a century."
          ]
        },
        {
          "type": "entries",
          "name": "Alignment",
          "entries": [
            "There is no clear alignment that is consistent among all lunarians. Just about any alignment can be justified."
          ]
        },
        {
          "type": "entries",
          "name": "Size",
          "entries": [
            "Lunarians in the One Piece World are typically very tall, perhaps between 7 and 8 feet tall and weigh between 280 and 340 pounds. Your size is Medium."
          ]
        },
        {
          "type": "entries",
          "name": "Speed",
          "entries": [
            "Your base walking speed is 25 feet."
          ]
        },
        {
          "type": "entries",
          "name": "Flight",
          "entries": [
            "You have a flying speed of 50 feet. To use this speed, you can't be wearing medium or heavy armor."
          ]
        },
        {
          "type": "entries",
          "name": "Fire Resistance",
          "entries": [
            "You have resistance to fire damage."
          ]
        },
        {
          "type": "entries",
          "name": "Ignite",
          "entries": [
            "You know the {@spell Produce Flame|PHB} cantrip. When you reach 3rd level, you can cast the {@spell Burning Hands} spell as a 2nd-level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the {@spell Flame Blade} spell once with this trait and regain the ability to do so when you finish a long rest. Constitution is your spellcasting ability for these spells."
          ]
        }
      ]
    },
    {
      "name": "Elbaf Giant",
      "source": "D&DF-PHB",
      "page": 24,
      "ability": [
        {
          "str": 4,
          "con": 4,
          "dex": -2,
          "int": -3
        }
      ],
      "size": "G",
      "speed": 40,
      "traitTags": [
        "Skill Proficiency"
      ],
      "entries": [
        "Your giant will have these traits.",
        {
          "type": "entries",
          "name": "Ability Score Increase",
          "entries": [
            "Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24. Your Dexterity score decreases by 2, and your Intelligence score decreases by 3."
          ]
        },
        {
          "type": "entries",
          "name": "Age",
          "entries": [
            "Giants can live for up to 300+ years."
          ]
        },
        {
          "type": "entries",
          "name": "Alignment",
          "entries": [
            "It can be assumed that many giants are neutral, but they can technically fall under any alignment."
          ]
        },
        {
          "type": "entries",
          "name": "Size",
          "entries": [
            "Giants in the One Piece World are typically 50-60 feet tall. Some can rest far outside this range, but your size will count as gargantuan."
          ]
        },
        {
          "type": "entries",
          "name": "Speed",
          "entries": [
            "Your base walking speed is 40 feet."
          ]
        },
        {
          "type": "entries",
          "name": "Warrior Training",
          "entries": [
            "You have proficiency with the Battleaxe, Handaxe, Light Hammer, Longsword, Club, and Spear."
          ]
        },
        {
          "type": "entries",
          "name": "Sheer Size",
          "entries": [
            "You have proficiency in the {@skill Athletics} and {@skill Intimidation} skills."
          ]
        },
        {
          "type": "entries",
          "name": "Overwhelming Charisma",
          "entries": [
            "Tales of you and your race's pride have spread throughout the world. Not only are you constantly oozing confidence in these things, but you can use your words to inspire and raise the spirits of your allies. Whenever you complete a Long Rest with your party, you can choose to spend 5 minutes making an inspiring speech, granting up to 5 allied creatures of your choice gain temporary HP equal to your proficiency bonus."
          ]
        },
        {
          "type": "entries",
          "name": "(Note:)",
          "entries": [
            "Once again, this race is incredibly overpowered so I wouldn't recommend using it in a balanced campaign. However, you may still choose to include this player race in your game if you so desire. Or you can decide to use it for NPC or enemy stat sheets.)"
          ]
        }
      ]
    }
  ],
  "background": [
    {
      "name": "Anthropologist",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "insight": true,
          "religion": true
        }
      ],
      "toolProficiencies": [
        {
          "any": 2
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A leather-bound diary"
            },
            {
              "item": "bottle of ink"
            },
            {
              "item": "ink pen"
            },
            {
              "item": "traveler's clothes"
            },
            {
              "special": "one trinket of special significance"
            },
            {
              "special": "a wallet containing ฿100000"
            }
          ]
        }
      ],
      "entries": [
        "You gain proficiency with one type of artisan's tools of your choice.",
        "Multicultural",
        "Before becoming an explorer or pirate, you have sought out a life among various cultures and races around the world. This may have led you to a location full of denizens of an entirely different race or culture. The folk of this place accepted you as one of their own and taught you their ways of life, enough for you to have a basic understanding of their culture, traditions, and beliefs.",
        "Choose a race whose culture you've adopted, or roll on the Adopted Culture table.",
        "Adopted Culture Table",
        {
          "type": "table",
          "colLabels": [
            "d8",
            "Culture"
          ],
          "rows": [
            [
              "1",
              "Fish-man"
            ],
            [
              "2",
              "Merfolk"
            ],
            [
              "3",
              "Mink"
            ],
            [
              "4",
              "Sky Islander"
            ],
            [
              "5",
              "Longarm Tribe"
            ],
            [
              "6",
              "Longleg Tribe"
            ],
            [
              "7",
              "Dwarf"
            ],
            [
              "8",
              "Giant"
            ]
          ]
        },
        "Feature: Cultural Chameleon",
        "You can begin to understand the traditions, dialects, and habits of any culture you spend enough time in. You must observe the creatures interacting with one another for at least 1 day, after which you learn a handful of important words, expressions, and gestures - enough to allow you to fit in with them on a basic level if the location isn't already hostile toward you.",
        "Suggested Characteristics",
        "Anthropologists thrive in other parts of the world that are far different from the ones they were born into. They love to study and explore new cultures and beliefs developed by other races and civilizations. Many anthropologists find these new locations to satisfy their intellectual curiosity or simply develop a newfound respect for different ideas. Some may seek out fame and fortune, while others do it for more humbling reasons.",
        "Anthropologist Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I enjoy traveling alongside different humanoid races."
            ],
            [
              "2",
              "It is always fun to observe local customs and traditions."
            ],
            [
              "3",
              "I prefer to listen rather than speak."
            ],
            [
              "4",
              "Through experiencing the wars between different cultures and races, I am desensitized to violence."
            ],
            [
              "5",
              "I have a personality defined by a culture that I have adopted."
            ],
            [
              "6",
              "I am beyond obsessed with learning about new cultures and civilizations or even studying dead ones."
            ]
          ]
        },
        "Anthropologist Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Discovery. I must be the first of my people to discover new or lost cultures. (Any)"
            ],
            [
              "2",
              "Distance. It is my personal duty to not interfere or tamper with any culture's traditions or beliefs. (Lawful)"
            ],
            [
              "3",
              "Knowledge. Documenting and journaling any information about different cultures gives me purpose. (Any)"
            ],
            [
              "4",
              "Power. Providing structure and strong leadership is important to any group of people that need it. (Lawful)"
            ],
            [
              "5",
              "Protection. The people of any civilization or culture must not be harmed by outsiders. (Good)"
            ],
            [
              "6",
              "Indifferent. The world is full of warring civilizations and warmongering factions. Why bother stopping them or saving anyone? (Chaotic)"
            ]
          ]
        },
        "Anthropologist Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "I have a journal full of the traditions and beliefs of other civilizations, and losing it would devastate me."
            ],
            [
              "2",
              "I once lived alongside a tribe of a different race, and I wish to visit them again someday."
            ],
            [
              "3",
              "Tragedy once befell a civilization I adored or lived with, so I will honor and avenge them."
            ],
            [
              "4",
              "I want to learn about a rare race or culture that interests me."
            ],
            [
              "5",
              "I will continue exploring until I find a legendary civilization I once read about."
            ],
            [
              "6",
              "A trinket I obtained long ago is the key to discovering or unlocking the path to a lost civilization."
            ]
          ]
        },
        "Anthropologist Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I do not get along with my own race very well."
            ],
            [
              "2",
              "I will not stay on the same island for any longer than I need to."
            ],
            [
              "3",
              "I've picked up many habits from a different culture that outsiders find unpleasant."
            ],
            [
              "4",
              "I must show other cultures how much better my culture is."
            ],
            [
              "5",
              "I feel the need to frequently complain."
            ],
            [
              "6",
              "I will never remove the jewelry or mask that was given to me at a young age."
            ]
          ]
        }
      ]
    },
    {
      "name": "Archaeologist",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "history": true,
          "survival": true
        }
      ],
      "toolProficiencies": [
        {
          "cartographer's tools": true,
          "navigator's tools": true
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A wooden case containing a map to a ruin or dungeon"
            },
            {
              "special": "a bullseye lantern"
            },
            {
              "special": "a miner's pick"
            },
            {
              "item": "traveler's clothes"
            },
            {
              "item": "shovel"
            },
            {
              "item": "tent"
            },
            {
              "special": "a trinket recovered from a dig site"
            },
            {
              "special": "a pouch containing ฿250000 worth of jewels."
            }
          ]
        }
      ],
      "entries": [
        "Excavator",
        "Through years of crawling through dust, working in excavation sites, and shoveling dirt, you have managed to collect a number of valuables or sold them to purchase a tool of choice. You have grow attached to this item and have continued to hold onto it. Roll on the Archaeologist Item table to see what you have, or choose an item from the table.",
        "Archaeologist Item Table",
        {
          "type": "table",
          "colLabels": [
            "d8",
            "Culture"
          ],
          "rows": [
            [
              "1",
              "10-foot pole"
            ],
            [
              "2",
              "Crowbar"
            ],
            [
              "3",
              "Hat"
            ],
            [
              "4",
              "Hood"
            ],
            [
              "5",
              "Medallion"
            ],
            [
              "6",
              "Shovel"
            ],
            [
              "7",
              "Sledge Hammer"
            ],
            [
              "8",
              "Whip"
            ]
          ]
        },
        "Feature: Historical Knowledge",
        "When you enter a ruin or abandoned location, you can correctly ascertain its original purpose and which known race or civilization it might be connected to. In addition, you can determine the monetary value of art objects more than a century old.",
        "Suggested Characteristics",
        "Archaeologists chase after the chance to explore any ruins, especially if it is known to have any amount of lost treasure or relics held within. Many archaeologists seek out adventure and knowledge from their searches, while others seek out fame and riches. Whatever their motivations, archaeologists are a combination of a self-made historian mixed with the qualities of a dedicated treasure-hunter.",
        "Archaeologist Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I very much enjoy solving puzzles and riddles."
            ],
            [
              "2",
              "Collecting any valuable that I come across is a must."
            ],
            [
              "3",
              "I seek out fame for my accomplishments over all else."
            ],
            [
              "4",
              "I am perfectly fine with stealing from any abandoned place."
            ],
            [
              "5",
              "Exploring an old tomb brings me more joy than touring any city."
            ],
            [
              "6",
              "Traps don't scare me. Idiots triggering them does, though."
            ]
          ]
        },
        "Archaeologist Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Preservation. I shouldn't tamper with any sacred artifacts or tomes. (Good)"
            ],
            [
              "2",
              "Greed. I will take whatever I can get, so long as it is worth the risk. (Any)"
            ],
            [
              "3",
              "Deathwish. The thrill of narrowly escaping danger is probably the greatest feeling. (Chaotic)"
            ],
            [
              "4",
              "Respect. I will stick to my personal code and never disrespect the dead. (Lawful)"
            ],
            [
              "5",
              "Glory. I seek out great power and recognition as a reward for all of my exploration. (Good)"
            ],
            [
              "6",
              "Courage. A great deal of bravery is required for finding any guarded treasure. (Any)"
            ]
          ]
        },
        "Archaeologist Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "As a kid, I heard stories about a legendary treasure. I wish to find it someday."
            ],
            [
              "2",
              "I will search day and night to find a legendary location that my ancestors couldn't."
            ],
            [
              "3",
              "There are several other treasure-hunters I know and respect, but I will be the best."
            ],
            [
              "4",
              "I could never sell an artifact that has historical significance or sentimental value to me."
            ],
            [
              "5",
              "I hope to gain approval from a certain someone for my finds."
            ],
            [
              "6",
              "I must return something valuable to a ruin that was stolen from long ago."
            ]
          ]
        },
        "Archaeologist Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I fear that someone out there is ready to steal from me at any time."
            ],
            [
              "2",
              "Every room must be searched for secret doors and switches."
            ],
            [
              "3",
              "When not exploring, I begin to grow grumpy and impatient."
            ],
            [
              "4",
              "I must leave many of my family and friends behind to seek out treasure and danger."
            ],
            [
              "5",
              "When deciding whether to go left or right, I always go right."
            ],
            [
              "6",
              "I always hesitate when having to leave any ruins that I explore."
            ]
          ]
        }
      ]
    },
    {
      "name": "Architect",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "sleight of hand": true,
          "perception": true
        }
      ],
      "toolProficiencies": [
        {
          "carpenter's tools": true,
          "anyArtisansTool": 1
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "item": "carpenter's tools"
            },
            {
              "special": "a blank book"
            },
            {
              "special": "1 ounce of ink"
            },
            {
              "item": "ink pen"
            },
            {
              "item": "traveler's clothes"
            },
            {
              "special": "a wallet with ฿100000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: I'll Patch It!",
        "Provided you have carpenter's tools and wood, you can perform repairs on a water vehicle or wooden building. When you focus on \"Ship Repair\" during travel time or spend a day of downtime near a building, you now restore a number of hit points to a component of a water vehicle or wooden building equal to 5 × your proficiency modifier.",
        "Life of Building",
        "Your life of drafting, designing, and building things have shaped you; you can roll on the following table to determine its impact or choose an element that best fits your character.",
        "Life of Building Table",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Influence"
          ],
          "rows": [
            [
              "1",
              "Ship Designs. You are working on plans and schematics for a new, very fast ship. You must examine as many different kinds of vessels as possible to help ensure the success of your design."
            ],
            [
              "2",
              "Solid and Sound. You patched up a war galley and prevented it from sinking. The local navy regards you as a friend."
            ],
            [
              "3",
              "Favored. You aided a merchant in repairing his roof before a devastating storm. You have a standing invitation to visit the merchant's distant mansion."
            ],
            [
              "4",
              "Master of Armaments. You specialized in designing and mounting defenses for a vulnerable town. You easily recognize and determine the quality of such items."
            ],
            [
              "5",
              "Low Places. You have contacts in the smuggling outfits along the coast; you occasionally repair the criminals' ships in exchange for money and favors."
            ],
            [
              "6",
              "Mysteries of the Deep. You experienced an encounter with an intelligent Sea King while sailing alone. Work with your DM to determine the secret about the deep waters of the sea that this creature revealed to you."
            ]
          ]
        },
        "Suggested Characteristics",
        "Architects are resourceful builders and designers. They often have a dedicated spot at the local tavern, since their job is invaluable to most communities. Architects have an affinity for working with their hands and often perform feats of carpentry and designing that others might deem miraculous.",
        "Architect Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I love talking and being heard more than I like to listen."
            ],
            [
              "2",
              "I'm extremely fond of puzzles."
            ],
            [
              "3",
              "I thrive under pressure."
            ],
            [
              "4",
              "I love sketching and designing objects, especially boats."
            ],
            [
              "5",
              "I'm not afraid of hard work—in fact, I prefer it."
            ],
            [
              "6",
              "I don't mind getting my hands dirty."
            ]
          ]
        },
        "Architect Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Crew. If everyone on deck pitches in, we'll never sink. (Good)"
            ],
            [
              "2",
              "Careful Lines. A building or ship must be balanced according to the laws of the universe. (Lawful)"
            ],
            [
              "3",
              "Invention. Make what you need out of whatever is at hand. (Chaotic)"
            ],
            [
              "4",
              "Perfection. To measure a being and find it lacking is the greatest disappointment. (Evil)"
            ],
            [
              "5",
              "Weaponry. It is important to design something that is equally effective and dangerous, even if it might cause trouble. (Chaotic)"
            ],
            [
              "6",
              "Hope. The horizon at sea holds the greatest promise. (Any)"
            ]
          ]
        },
        "Architect Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "I must visit all the oceans of the world and behold the ships and buildings there."
            ],
            [
              "2",
              "Much of the treasure I claim will be used to enrich my community."
            ],
            [
              "3",
              "I must find the legendary Adam Wood, which is rumored to be many times stronger than regular wood."
            ],
            [
              "4",
              "I repair broken things to redeem what's broken in myself."
            ],
            [
              "5",
              "I will craft a boat capable of controlling the world."
            ],
            [
              "6",
              "A sea monster destroyed my magnum opus, now I must rebuild it and seek revenge on the creature."
            ]
          ]
        },
        "Architect Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I don't know when to throw something away. You never know when it might be useful again."
            ],
            [
              "2",
              "I get frustrated to the point of distraction by shoddy craftsmanship."
            ],
            [
              "3",
              "Though I am an excellent crafter, my work tends to look as though it belongs on a ship."
            ],
            [
              "4",
              "I am so obsessed with sketching my ideas for elaborate inventions that I sometimes forget little thing like eating and sleeping."
            ],
            [
              "5",
              "I'm judgmental of those who are not skilled with tools of some kind."
            ],
            [
              "6",
              "I sometimes take things that don't belong to me, especially if they are very well made."
            ]
          ]
        }
      ]
    },
    {
      "name": "Celebrity",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "persuasion": true,
          "performance": true
        }
      ],
      "toolProficiencies": [
        {
          "disguise kit": true,
          "calligrapher's supplies": true
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "Disguise kit"
            },
            {
              "special": "a set of fine clothes"
            },
            {
              "special": "a wallet containing ฿300000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Face of a Star",
        "Many folk know you within your homeland. You may even be a world-renowned figure or idol. Gathering support from minor authority figures could be very possible at various points in the campaign, at the DM's discretion. Additionally, the common folk will often recognize you and treat you with a great deal of respect, and your face and clothing will oftentimes earn you a free meal or a place to sleep.",
        "Suggested Characteristics",
        "Celebrities are often tasked at dealing with both positive and negative press, pleasing tons of fans, and coping with a boatload of stress. Though many may recognize and praise you, some may use your fame against you. You must learn to use your status as a tool or weapon to your advantage, or find ways to avoid getting recognized by commoners.",
        "Celebrity Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I will never go unrecognized in public, and nobody will understand that burden."
            ],
            [
              "2",
              "As I travel and explore, my fans will follow."
            ],
            [
              "3",
              "I love the spotlight in any given situation."
            ],
            [
              "4",
              "I'm used to being spoiled by good food and furniture."
            ],
            [
              "5",
              "I love to steal flashy things from my enemies."
            ],
            [
              "6",
              "No one can fake a smile like I can."
            ]
          ]
        },
        "Celebrity Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Power. I must have it all, by any means necessary. (Evil)"
            ],
            [
              "2",
              "Peace. Making my friends and followers feel calm brings me comfort. (Lawful)"
            ],
            [
              "3",
              "Fame. I've seen what fame can bring. And I'll do my best to reach the top. (Neutral)"
            ],
            [
              "4",
              "Training. Sculpting my body, behavior, and hygiene to always be at its peak is key to success. (Any)"
            ],
            [
              "5",
              "Anonymity. I want to be successful, but I must also have alone time away from my fans. (Any)"
            ],
            [
              "6",
              "Love. Friendship and family triumph all wealth. (Good)"
            ]
          ]
        },
        "Celebrity Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "My servants have always been there for me, I cherish them the most."
            ],
            [
              "2",
              "I consider every member of my crew to be family."
            ],
            [
              "3",
              "I have a famous parent that left me at a young age, but I still respect them. I love them and want to make them proud."
            ],
            [
              "4",
              "A fan once gifted me a cursed item. It is now my obsession."
            ],
            [
              "5",
              "The one who helped make me famous is like a parent to me. I will cherish them forever."
            ],
            [
              "6",
              "Growing up, I had a friend that encouraged me to become famous. I wish to speak with them again someday."
            ]
          ]
        },
        "Celebrity Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "You don't know what I'm going through. You never can."
            ],
            [
              "2",
              "You. Fetch my coat. And maybe rub my feet for a while."
            ],
            [
              "3",
              "Oh, yeah, that ability? It is a special name I came up with. Let me tell you about it."
            ],
            [
              "4",
              "My comrades are brave, but I must defeat this threat alone to prove my worth."
            ],
            [
              "5",
              "The anxiety and responsibility from my fame brings me toil, depression, and pain."
            ],
            [
              "6",
              "You have to look out for yourself. No one else will."
            ]
          ]
        }
      ]
    },
    {
      "name": "Entertainer",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "acrobatics": true,
          "performance": true
        }
      ],
      "toolProficiencies": [
        {
          "disguise kit": true,
          "anyMusicalInstrument": 1
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A musical instrument (one of your choice other than piano)"
            },
            {
              "special": "costume clothes"
            },
            {
              "special": "a wallet containing ฿150000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: By Popular Demand",
        "You can always find a place to perform, usually in an inn or tavern but possibly with a circus, at a theater, or concert. At such a place, you receive free lodging and food of a modest or comfortable standard (depending on the quality of the establishment), as long as you perform each night. In addition, your performance makes you something of a local figure. When strangers recognize you in a town where you have performed, they typically take a liking to you.",
        "Specialty",
        "A good entertainer is versatile, spicing up every performance with a variety of different routines. Choose one to three routines or roll on the table below to define your expertise as an entertainer.",
        "Specialty Table",
        {
          "type": "table",
          "colLabels": [
            "d10",
            "Routine"
          ],
          "rows": [
            [
              "1",
              "Actor."
            ],
            [
              "2",
              "Dancer."
            ],
            [
              "3",
              "Fire-eater."
            ],
            [
              "4",
              "Clown."
            ],
            [
              "5",
              "Juggler."
            ],
            [
              "6",
              "Acrobat."
            ],
            [
              "7",
              "Instrumentalist."
            ],
            [
              "8",
              "Poet."
            ],
            [
              "9",
              "Singer."
            ],
            [
              "10",
              "Storyteller."
            ]
          ]
        },
        "Suggested Characteristics",
        "Successful entertainers have to be able to capture and hold an audience's attention, so they tend to have flamboyant or forceful personalities. They're inclined toward the romantic and often cling to high-minded ideals about the practice of art and the appreciation of beauty.",
        "Entertainer Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I know a story relevant to almost every situation."
            ],
            [
              "2",
              "Whenever I come to a new place, I collect local rumors and spread gossip."
            ],
            [
              "3",
              "I'm a hopeless romantic, always searching for that \"special someone\"."
            ],
            [
              "4",
              "Nobody stays angry at me or around me for long, since I can defuse any amount of tension."
            ],
            [
              "5",
              "I love a good insult, even one directed at me."
            ],
            [
              "6",
              "I get bitter if I'm not the center of attention."
            ]
          ]
        },
        "Entertainer Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Beauty. When I perform, I make the world better than it was. (Good)"
            ],
            [
              "2",
              "Tradition. The stories, legends, and songs of the past must never be forgotten, for they teach us who we are. (Lawful)"
            ],
            [
              "3",
              "Greed. I'm only in it for the money and fame. (Evil)"
            ],
            [
              "4",
              "Creativity. The world is in need of new ideas and bold action. (Chaotic)"
            ],
            [
              "5",
              "People. I like seeing the smiles on people's faces when I perform. That's all that matters. (Neutral)"
            ],
            [
              "6",
              "Honesty. Art should reflect the soul; it should come from within and reveal who we really are. (Any)"
            ]
          ]
        },
        "Entertainer Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "My instrument is my most treasured possession, and it reminds me of someone I love."
            ],
            [
              "2",
              "Someone stole my precious instrument, and someday I'll get it back."
            ],
            [
              "3",
              "I want to be famous, whatever it takes."
            ],
            [
              "4",
              "I idolize a hero of the old tales and measure my deeds against that person's."
            ],
            [
              "5",
              "My hated rival hurt me greatly long ago, and I seek power and revenge."
            ],
            [
              "6",
              "I made a promise to a friend many years back, and I still aim to keep it."
            ]
          ]
        },
        "Entertainer Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I'll do anything to win fame and renown."
            ],
            [
              "2",
              "I'm a sucker for a pretty face."
            ],
            [
              "3",
              "A scandal prevents me from ever going home again. That kind of trouble seems to follow me around."
            ],
            [
              "4",
              "I once satirized a noble who still wants my head. It was a mistake that I will likely repeat."
            ],
            [
              "5",
              "I have trouble keeping my true feelings hidden. My sharp tongue lands me in trouble."
            ],
            [
              "6",
              "Despite my best efforts, I am unreliable to my friends."
            ]
          ]
        }
      ]
    },
    {
      "name": "Folk Hero",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "animal handling": true,
          "survival": true
        }
      ],
      "toolProficiencies": [
        {
          "anyArtisansTool": 1,
          "vehicles (land)": true
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A set of artisan's tools (one of your choice)"
            },
            {
              "item": "shovel"
            },
            {
              "special": "an iron pot"
            },
            {
              "special": "a set of common clothes"
            },
            {
              "special": "a wallet containing ฿100000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Rustic Hospitality",
        "Since you come from the ranks of the common folk, you fit in among them with ease. You can find a place to hide, rest, or recuperate among other commoners, unless you have shown yourself to be a danger to them. They will shield you from the marines or anyone else searching for you, though they will not risk their lives for you.",
        "Specialty",
        "You previously pursued a simple profession among the peasantry, perhaps as a farmer, miner, servant, shepherd, woodcutter, or gravedigger. But something happened that set you on a different path and marked you for greater things. Choose or randomly determine a defining event that marked you as a hero of the people.",
        "Specialty Table",
        {
          "type": "table",
          "colLabels": [
            "d10",
            "Defining Event"
          ],
          "rows": [
            [
              "1",
              "I stood up to a tyrannical noble."
            ],
            [
              "2",
              "I saved people during a natural disaster."
            ],
            [
              "3",
              "I stood alone against a rampaging Sea King."
            ],
            [
              "4",
              "I stole from a corrupt merchant to help the poor."
            ],
            [
              "5",
              "I led a militia to fight off an invading army."
            ],
            [
              "6",
              "I broke into a marine base and stole weapons to arm the people."
            ],
            [
              "7",
              "I trained the village peasants to stand up against thieving mountain bandits."
            ],
            [
              "8",
              "A world noble returned a slave to their village after I led a protest against them."
            ],
            [
              "9",
              "I defended a group of fishmen, mink, or merfolk from persecution by a marine ship."
            ],
            [
              "10",
              "Recruited into a nation's military, I rose to leadership and was commended for my heroism."
            ]
          ]
        },
        "Suggested Characteristics",
        "A folk hero is one of the common people, for better or for worse. Most folk heroes look on their humble origins as a virtue, not a shortcoming, and their home communities remain very important to them.",
        "Folk Hero Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I judge people by their actions, not their words."
            ],
            [
              "2",
              "If someone is in trouble, I'm always ready to lend help."
            ],
            [
              "3",
              "When I set my mind to something, I follow through no matter what gets in my way."
            ],
            [
              "4",
              "I have a strong sense of fair play and always try to find the most equitable solution to arguments."
            ],
            [
              "5",
              "I'm confident in my own abilities and do what I can to instill confidence in others."
            ],
            [
              "6",
              "Thinking is for other people. I prefer action."
            ]
          ]
        },
        "Folk Hero Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Respect. People deserve to be treated with dignity and respect. (Good)"
            ],
            [
              "2",
              "Fairness. No one should get preferential treatment before the law, and no one is above the law. (Lawful)"
            ],
            [
              "3",
              "Freedom. Tyrants must not be allowed to oppress the people. (Chaotic)"
            ],
            [
              "4",
              "Might. If I become strong, I can take what I want—what I deserve. (Evil)"
            ],
            [
              "5",
              "Sincerity. There's no good in pretending to be something I'm not. (Neutral)"
            ],
            [
              "6",
              "Destiny. Nothing and no one can steer me away from my higher calling. (Any)"
            ]
          ]
        },
        "Folk Hero Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "I have a family, but I have no idea where they are. One day, I hope to see them again."
            ],
            [
              "2",
              "I worked the land, I love the land, and I will protect the land."
            ],
            [
              "3",
              "A proud world noble once gave me a horrible beating, and I will take my revenge on any bully I encounter."
            ],
            [
              "4",
              "My tools are symbols of my past life, and I carry them so that I will never forget my roots."
            ],
            [
              "5",
              "I protect those who cannot protect themselves."
            ],
            [
              "6",
              "I wish my childhood sweetheart had come with me to pursue my destiny."
            ]
          ]
        },
        "Folk Hero Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "My past selfless actions have placed a large bounty on my head, which might burden my allies."
            ],
            [
              "2",
              "I'm convinced of the significance of my destiny, and blind to my shortcomings and the risk of failure."
            ],
            [
              "3",
              "The people who knew me when I was young know my shameful secret, so I can never go home again."
            ],
            [
              "4",
              "I have a weakness for the vices of the city, especially hard drink."
            ],
            [
              "5",
              "Secretly, I believe that things would be better if I were a tyrant lording over the land."
            ],
            [
              "6",
              "I have trouble trusting in my allies."
            ]
          ]
        }
      ]
    },
    {
      "name": "Gambler",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "deception": true,
          "insight": true
        }
      ],
      "toolProficiencies": [
        {
          "anyGamingSet": 2
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "Two gaming sets"
            },
            {
              "special": "a lucky charm"
            },
            {
              "special": "a set of fine clothes"
            },
            {
              "special": "a wallet containing ฿150000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Never Tell Me the Odds",
        "Odds and probability are your bread and butter. During downtime activities that involve games of chance or figuring odds on the best plan, you can get a solid sense of which choice is likely the best one and which opportunities seem too good to be true, at the DM's determination.",
        "Suggested Characteristics",
        "Some gamble out of necessity. Others do so out of boredom. Still others become addicted to the thrill of winning or losing everything on a turn of fortune. For some, gambling is less a matter of chance and more a matter of seeking every advantage to ensure the outcome. The best gamblers can lose everything, and the worst gamblers sometimes win. Regardless, you can always tell gamblers by the look in their eyes. Lady Luck haunts them.",
        "Gambler Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I plan for every contingency. Leave nothing to chance!"
            ],
            [
              "2",
              "Every hundred Belly (฿) can become a thousand. Each bet is an opportunity."
            ],
            [
              "3",
              "I'm one of Lady Luck's favored. Anything I try is destined to succeed."
            ],
            [
              "4",
              "I've lost so much to gambling that I refuse to spend money on anything anymore."
            ],
            [
              "5",
              "Nothing is certain. Planning is a coward's act."
            ],
            [
              "6",
              "I have beaten my addiction, but all it takes is one weak moment and I'll be back at the card table."
            ]
          ]
        },
        "Gambler Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Knowledge. Knowledge is power, and knowing which horse to back is the key to success. (Any)"
            ],
            [
              "2",
              "Fate. Whatever happens is fated, regardless of any planning or striving. (Lawful)"
            ],
            [
              "3",
              "Bravery. If you want to succeed, you have to take risks. (Chaotic)"
            ],
            [
              "4",
              "Survival. You can't win if you're dead. Live to fight another day—when the odds might be more in your favor. (Any)"
            ],
            [
              "5",
              "Reliability. When I was in need, I was able to rely on others. Now I want to be the one others rely on. (Good)"
            ],
            [
              "6",
              "Victory. Winning is the real measure of a person. In the end, the only thing that matters is the scoreboard. (Evil)"
            ]
          ]
        },
        "Gambler Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "One person in particular owes me a lot of money, and I need to keep them alive if I want to be repaid."
            ],
            [
              "2",
              "I'm loyal to the friend or family member who taught me how to gamble."
            ],
            [
              "3",
              "The person who saved me from my gambling addiction is the only reason I'm alive today."
            ],
            [
              "4",
              "A patron once fronted me money in exchange for a percentage of my winnings. I owe them a debt of gratitude. And a lot of cash."
            ],
            [
              "5",
              "A criminal syndicate I once played for isn't happy I left the game, and its enforcers are looking for me."
            ],
            [
              "6",
              "It's my dream to find a legendary casino that'll win me all the riches in the world."
            ]
          ]
        },
        "Gambler Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I don't know when to quit. Especially when everyone else is telling me to."
            ],
            [
              "2",
              "I save my sympathy for my friends, and I have no friends."
            ],
            [
              "3",
              "You think we're in trouble now? Let me tell you how bad things are likely to get!"
            ],
            [
              "4",
              "You can loan me a little, right? I've got a sure thing. I'll double your money, guaranteed."
            ],
            [
              "5",
              "I was once a terribly flawed person, like you. Let me tell you how you can save yourself."
            ],
            [
              "6",
              "I'm a great gambler. I'm just bad at math and logic."
            ]
          ]
        }
      ]
    },
    {
      "name": "Gladiator",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "acrobatics": true,
          "athletics": true
        }
      ],
      "toolProficiencies": [
        {
          "smith's tools": true,
          "vehicles (land)": true
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A bronze gladiator helmet or brace"
            },
            {
              "special": "a lucky charm or past trophy"
            },
            {
              "item": "traveler's clothes"
            },
            {
              "special": "a wallet containing ฿100000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Arena Master",
        "You have attracted admiration among spectators, fellow gladiators, and trainers all around the world who have watched you perform. When visiting any settlement with an arena or coliseum in it, there is a 50 percent chance you can find someone there who admires you and is willing to provide information or temporary shelter.",
        "Favored Event",
        "While many gladiators practice various coliseum events, most excel at a single form of competition. Roll or choose from the options in the Favored Event table to determine the event in which you excel.",
        "Favored Event Table",
        {
          "type": "table",
          "colLabels": [
            "d8",
            "Event"
          ],
          "rows": [
            [
              "1",
              "Armed Duels"
            ],
            [
              "2",
              "Animal Hunts"
            ],
            [
              "3",
              "Beast Battles"
            ],
            [
              "4",
              "Horse Racing"
            ],
            [
              "5",
              "Fist Fights"
            ],
            [
              "6",
              "Chariot Battles"
            ],
            [
              "7",
              "Jousting"
            ],
            [
              "8",
              "Ranged Weapon Battles"
            ]
          ]
        },
        "Gladiator Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I feel most at peace during physical exertion, be it exercise or battle."
            ],
            [
              "2",
              "Anything worth doing is worth doing best."
            ],
            [
              "3",
              "I have a daily exercise routine that I refuse to break."
            ],
            [
              "4",
              "Obstacles exist to be overcome."
            ],
            [
              "5",
              "When I see others struggling, I offer to help."
            ],
            [
              "6",
              "I get irritated if people praise someone else and not me."
            ]
          ]
        },
        "Gladiator Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Competition. I strive to test myself in all things. (Chaotic)"
            ],
            [
              "2",
              "Triumph. The best part of winning is seeing my rivals brought low. (Evil)"
            ],
            [
              "3",
              "Camaraderie. The strongest bonds are forged through struggle. (Good)"
            ],
            [
              "4",
              "People. I strive to inspire my spectators. (Neutral)"
            ],
            [
              "5",
              "Tradition. Every game has rules, and the playing field must be level. (Lawful)"
            ],
            [
              "6",
              "Growth. Lessons hide in victory and defeat. (Any)"
            ]
          ]
        },
        "Gladiator Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "My teammates are my family."
            ],
            [
              "2",
              "I will overcome a rival and prove myself their better."
            ],
            [
              "3",
              "My mistake got someone hurt. I'll never make that mistake again."
            ],
            [
              "4",
              "I will be the best fighter in the world for the honor and glory of my home."
            ],
            [
              "5",
              "The person who trained me is the most important person in my world."
            ],
            [
              "6",
              "I strive to live up to a specific gladiator or hero's example."
            ]
          ]
        },
        "Gladiator Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I indulge in a habit that threatens my reputation or my health."
            ],
            [
              "2",
              "I'll do absolutely anything to win."
            ],
            [
              "3",
              "I ignore anyone who doesn't compete and anyone who loses to me."
            ],
            [
              "4",
              "I have lingering pain from old injuries."
            ],
            [
              "5",
              "Any defeat or failure on my part is because my opponent cheated."
            ],
            [
              "6",
              "I must be the captain of any crew I join."
            ]
          ]
        }
      ]
    },
    {
      "name": "Hermit",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "medicine": true,
          "religion": true
        }
      ],
      "toolProficiencies": [
        {
          "herbalism kit": true,
          "anyArtisansTool": 1
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A scroll case stuffed full of notes from your studies or prayers"
            },
            {
              "special": "a winter blanket"
            },
            {
              "special": "a set of common clothes"
            },
            {
              "item": "herbalism kit"
            },
            {
              "special": "฿50000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Discovery",
        "The quiet seclusion of your extended hermitage gave you access to a unique and powerful discovery. The exact nature of this revelation depends on the nature of your seclusion. It might be a great truth about the cosmos, spirits, or the forces of nature. It could be a site that no one else has ever seen. You might have uncovered a fact that has long been forgotten, or unearthed some relic of the past that could rewrite history. It might be information that would be damaging to the people who or consigned you to exile, and hence the reason for your return to society.",
        "Work with your DM to determine the details of your discovery and its impact on the campaign.",
        "Specialty",
        "What was the reason for your isolation, and what changed to allow you to end your solitude? You can work with your DM to determine the exact nature of your seclusion, or you can choose or roll on the table below to determine the reason behind your seclusion.",
        "Specialty Table",
        {
          "type": "table",
          "colLabels": [
            "d8",
            "Life of Seclusion"
          ],
          "rows": [
            [
              "1",
              "I was searching for spiritual enlightenment."
            ],
            [
              "2",
              "I was partaking of communal living in accordance with the dictates of a religious order."
            ],
            [
              "3",
              "I was exiled for a crime I didn't commit."
            ],
            [
              "4",
              "I retreated from society after a life-altering event."
            ],
            [
              "5",
              "I needed a quiet place to work on my art, literature, music, or manifesto."
            ],
            [
              "6",
              "I needed to commune with nature, far from civilization."
            ],
            [
              "7",
              "I wanted to meditate and train alone to strengthen my physical, mental, and spiritual power."
            ],
            [
              "8",
              "I was a pilgrim in search of a person, place, or relic of spiritual significance."
            ]
          ]
        },
        "Suggested Characteristics",
        "Some hermits are well suited to a life of seclusion, whereas others chafe against it and long for company. Whether they embrace solitude or long to escape it, the solitary life shapes their attitudes and ideals. A few are driven slightly mad by their years apart from society.",
        "Hermit Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I've been isolated for so long that I rarely speak, preferring gestures and the occasional grunt."
            ],
            [
              "2",
              "I am utterly serene, even in the face of disaster."
            ],
            [
              "3",
              "I connect everything that happens to me to a grand, cosmic plan."
            ],
            [
              "4",
              "I feel tremendous empathy for all who suffer."
            ],
            [
              "5",
              "I'm oblivious to etiquette and social expectations."
            ],
            [
              "6",
              "I am working on a grand philosophical theory and love sharing my ideas."
            ]
          ]
        },
        "Hermit Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Greater Good. My gifts are meant to be shared with all, not used for my own benefit. (Good)"
            ],
            [
              "2",
              "Logic. Emotions must not cloud our sense of what is right and true, or our logical thinking. (Lawful)"
            ],
            [
              "3",
              "Free Thinking. Inquiry and curiosity are the pillars of progress. (Chaotic)"
            ],
            [
              "4",
              "Power. Solitude and contemplation are paths toward mystical or magical power. (Evil)"
            ],
            [
              "5",
              "Live and Let Live. Meddling in the affairs of others only causes trouble. (Neutral)"
            ],
            [
              "6",
              "Self-Knowledge. If you know yourself, there's nothing left to know. (Any)"
            ]
          ]
        },
        "Hermit Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "Nothing is more important than the other members of my hermitage, order, or association."
            ],
            [
              "2",
              "I entered seclusion to hide from the ones who might still be hunting me. I must someday confront them."
            ],
            [
              "3",
              "I'm still seeking the ultimate enlightenment I pursued in my seclusion, and it still eludes me."
            ],
            [
              "4",
              "I entered seclusion because I wished to grow stronger."
            ],
            [
              "5",
              "Should my discovery come to light, it could bring ruin to the world."
            ],
            [
              "6",
              "My isolation gave me great insight into a great evil that only I can destroy."
            ]
          ]
        },
        "Hermit Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "Now that I've returned to the world, I enjoy its delights a little too much."
            ],
            [
              "2",
              "I harbor dark, bloodthirsty thoughts that my isolation and meditation failed to quell."
            ],
            [
              "3",
              "I am dogmatic in my thoughts and philosophy."
            ],
            [
              "4",
              "I let my need to win arguments overshadow friendships and harmony."
            ],
            [
              "5",
              "I'd risk too much to uncover a lost bit of knowledge."
            ],
            [
              "6",
              "I like keeping secrets and won't share them with anyone."
            ]
          ]
        }
      ]
    },
    {
      "name": "Knight",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "athletics": true,
          "persuasion": true
        }
      ],
      "toolProficiencies": [
        {
          "anyGamingSet": 1,
          "anyMusicalInstrument": 1
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "item": "traveler's clothes"
            },
            {
              "special": "a signet"
            },
            {
              "special": "banner"
            },
            {
              "special": "or seal representing your place or rank in the order"
            },
            {
              "special": "a wallet containing ฿100000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Knightly Regard",
        "Knights are defenders that fight for the inhabitants of a kingdom, following under the code of Chivalry. You have pledged allegiance to a kingdom or monarch, and ascended the ranks to earn your rank. You may have left your duties behind to go explore the world, but you are still well-respected by your kingdom and people. You receive shelter and succor from members of your kingdom and those who are sympathetic to its aims.",
        "This help comes in the form of shelter and meals, and healing when appropriate, as well as occasionally risky assistance, such as a band of local citizens rallying to aid a sorely pressed knight, or those who support the order helping to smuggle a knight out of town when he or she is being hunted unjustly.",
        "Specialty",
        "What kingdom or monarch do you serve under? Roll on this table or choose one of the listed kingdoms to decide which kingdom you serve. You may also use a separate kingdom of your choice instead of the below ones.",
        "Kingdom Table",
        {
          "type": "table",
          "colLabels": [
            "d12",
            "Kingdom"
          ],
          "rows": [
            [
              "1",
              "Lulusia Kingdom"
            ],
            [
              "2",
              "Germa Kingdom"
            ],
            [
              "3",
              "Shikkearu Kingdom"
            ],
            [
              "4",
              "Torino Kingdom"
            ],
            [
              "5",
              "Dressrosa Kingdom"
            ],
            [
              "6",
              "Bourgeois Kingdom"
            ],
            [
              "7",
              "Standing Kingdom"
            ],
            [
              "8",
              "Tehna Gehna Kingdom"
            ],
            [
              "9",
              "Alabasta Kingdom"
            ],
            [
              "10",
              "Sky Island Kingdom"
            ],
            [
              "11",
              "Drum Kingdom"
            ],
            [
              "12",
              "Ryugu Kingdom"
            ]
          ]
        },
        "Suggested Characteristics",
        "Your bond almost always involves the kingdom to which you belong (or at least key members of it), and it is highly unusual for a knight's ideal not to reflect the agenda, sentiment, or philosophy of one's monarch or kingdom's leaders.",
        "Knight Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I'm always polite and respectful."
            ],
            [
              "2",
              "I'm haunted by memories of battle. I can't get the images of violence out of my mind."
            ],
            [
              "3",
              "I'm full of inspiring and cautionary tales from my military experience relevant to almost every combat situation."
            ],
            [
              "4",
              "I can stare down a hell hound without flinching."
            ],
            [
              "5",
              "I have a crude sense of humor."
            ],
            [
              "6",
              "I face problems head-on. A simple, direct solution is the best path to success."
            ]
          ]
        },
        "Knight Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Greater Good. Our lot is to lay down our lives in defense of others. (Good)"
            ],
            [
              "2",
              "Responsibility. I do what I must and obey just authority. (Lawful)"
            ],
            [
              "3",
              "Independence. When people follow orders blindly, they embrace a kind of tyranny. (Chaotic)"
            ],
            [
              "4",
              "Might. In life as in battle, the stronger force wins. (Evil)"
            ],
            [
              "5",
              "Live and Let Live. Ideals aren't worth killing over or going to battle for. (Neutral)"
            ],
            [
              "6",
              "Nation. My city, nation, or people are all that matter. (Any)"
            ]
          ]
        },
        "Knight Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "I would still lay down my life for the people I served with."
            ],
            [
              "2",
              "Someone saved my life on the battlefield. To this day, I will never leave a friend behind."
            ],
            [
              "3",
              "My honor is my life."
            ],
            [
              "4",
              "I'll never forget the crushing defeat my company suffered or the enemies who dealt it."
            ],
            [
              "5",
              "Those who fight beside me are those worth dying for."
            ],
            [
              "6",
              "I fight for those who cannot fight for themselves."
            ]
          ]
        },
        "Knight Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "The monstrous enemy we faced in battle still leaves me quivering with fear."
            ],
            [
              "2",
              "I have little respect for anyone who is not a proven warrior."
            ],
            [
              "3",
              "I made a terrible mistake in battle that cost many lives—and I would do anything to keep that mistake secret."
            ],
            [
              "4",
              "My hatred of my enemies is blinding and unreasoning."
            ],
            [
              "5",
              "I obey the law, even if the law causes misery."
            ],
            [
              "6",
              "I'd rather eat my armor than admit when I'm wrong."
            ]
          ]
        }
      ]
    },
    {
      "name": "Kuja",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "athletics": true,
          "intimidation": true
        }
      ],
      "toolProficiencies": [
        {
          "anyGamingSet": 1,
          "vehicles (land)": true
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "An insignia of a snake"
            },
            {
              "special": "a white Kuja cape"
            },
            {
              "special": "a bone dice set or playing card set"
            },
            {
              "special": "a set of common clothes"
            },
            {
              "special": "a wallet containing ฿100000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Kuja Warrior",
        "You were born and raised on Amazon Lily, alongside many others in the Kuja tribe. All warriors here are women, and have fierce fighting abilities and nearly unmatched strength. Before venturing away from Amazon Lily, you may have lived as a pirate, islander, or warrior for the Kuja Clan. Any other Kuja Tribe member you encounter will treat you with respect, along with any other female in your party.",
        "Kuja Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I'm always polite and respectful to other women."
            ],
            [
              "2",
              "I'm haunted by memories of battle. I can't get the images of violence out of my mind."
            ],
            [
              "3",
              "I'm full of inspiring and cautionary tales I heard while living on Amazon Lily."
            ],
            [
              "4",
              "I can stare down a hell hound without flinching."
            ],
            [
              "5",
              "I have a crude sense of humor."
            ],
            [
              "6",
              "I face problems head-on. A simple, direct solution is the best path to success."
            ]
          ]
        },
        "Kuja Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Greater Good. Our lot is to lay down our lives in defense of other women and children. (Good)"
            ],
            [
              "2",
              "Responsibility. I do what I must and obey just authority, so long they are female. (Lawful)"
            ],
            [
              "3",
              "Independence. When people follow orders blindly, they embrace a kind of tyranny. (Chaotic)"
            ],
            [
              "4",
              "Might. In life as in battle, the stronger force wins. (Evil)"
            ],
            [
              "5",
              "Live and Let Live. Ideals aren't worth killing over or going to battle for. (Neutral)"
            ],
            [
              "6",
              "Nation. The Kuja Tribe and it's people are all that matter. (Any)"
            ]
          ]
        },
        "Kuja Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "I would still lay down my life for the women I lived with."
            ],
            [
              "2",
              "A man once saved my life on the battlefield. To this day, I feel compelled to help everyone equally."
            ],
            [
              "3",
              "My honor is my life."
            ],
            [
              "4",
              "I'll never forget the crushing defeat my tribe suffered by the hands of men."
            ],
            [
              "5",
              "Women who fight beside me are those worth dying for."
            ],
            [
              "6",
              "I fight for those who cannot fight for themselves."
            ]
          ]
        },
        "Kuja Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "The monstrous enemy we faced in battle still leaves me quivering with fear."
            ],
            [
              "2",
              "I have little respect for anyone who is not a strong woman."
            ],
            [
              "3",
              "I made a terrible mistake in battle that cost many lives—and I would do anything to keep that mistake secret."
            ],
            [
              "4",
              "Contrary to my tribe's core beliefs, I am obsessed with men."
            ],
            [
              "5",
              "I obey the laws of my tribe, even if they confuse others."
            ],
            [
              "6",
              "I will never admit I'm wrong, especially not to a man."
            ]
          ]
        }
      ]
    },
    {
      "name": "Marine (or Ex-Marine)",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "athletics": true,
          "survival": true
        }
      ],
      "toolProficiencies": [
        {
          "cartographer's tools": true,
          "vehicles (land)": true
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A dagger that belonged to a fallen comrade"
            },
            {
              "special": "a folded flag emblazoned with the symbol of the marines"
            },
            {
              "item": "traveler's clothes"
            },
            {
              "special": "a wallet containing ฿100000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Marching Orders",
        "You can move twice the normal amount of time (up to 16 hours) each day before being subject to the effect of a forced march (see \"Travel Pace\" in chapter 8 of the D&D Player's Handbook). Additionally, you can automatically find a safe route to land a boat on shore, provided such a route exists.",
        "Hardship Endured",
        "Your past as a Marine has forged you into an unstoppable living weapon. This hardship is essential to you and is at the heart of a personal philosophy or ethos that often guides your actions. It might also be the reason you potentially left the marines. You can roll on the following table to determine this hardship or choose one that best fits your character.",
        "Hardship Endured Table",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Hardship"
          ],
          "rows": [
            [
              "1",
              "Mutiny. Your crew overthrew you and left you stranded on an island in the middle of nowhere."
            ],
            [
              "2",
              "Captured. You spent months enduring thirst, starvation, and torture at the hands of your enemy, but you never broke."
            ],
            [
              "3",
              "Sacrifice. You enabled the escape of your fellow soldiers, but at great cost to yourself. Some of your past comrades may think you're dead."
            ],
            [
              "4",
              "Juggernaut. No reasonable explanation can explain how you survived a particular battle. Every arrow and bolt missed you. You slew scores of enemies single-handedly and led your comrades to victory."
            ],
            [
              "5",
              "Tyranny. After exposing a corrupt high-ranking marine, you were silenced, beaten, and imprisoned for years."
            ],
            [
              "6",
              "Leave None Behind. You carried an injured marine for miles to avoid capture and death."
            ]
          ]
        },
        "Suggested Characteristics",
        "Marines are looked up to by many civilians and must always obey their superiors. They are veteran warriors who rarely lose composure on the battlefield. Marines who leave the service tend to work as mercenaries, but their combat experience also makes them excellent adventurers or pirates. Though they are self-reliant, marines tend to operate best in groups, valuing camaraderie and the companionship of like-minded individuals.",
        "Marine Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I speak rarely but mean every word I say."
            ],
            [
              "2",
              "I laugh loudly and see the humor in stressful situations."
            ],
            [
              "3",
              "I prefer to solve problems without violence, but I finish fights decisively."
            ],
            [
              "4",
              "I am dependable."
            ],
            [
              "5",
              "I am often considered a lone wolf, and I must enforce my own form of law."
            ],
            [
              "6",
              "When the sea is within my sight, my mood is jovial and optimistic."
            ]
          ]
        },
        "Marine Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Teamwork. Success depends on cooperation and communication. (Good)"
            ],
            [
              "2",
              "Code. The marines' code provides a solution for every problem, and following it is imperative. (Lawful)"
            ],
            [
              "3",
              "Embracing. Life is messy. Throwing yourself into the worst of it is necessary to get the job done. (Chaotic)"
            ],
            [
              "4",
              "Might. The strong train so that they might rule those who are weak. (Evil)"
            ],
            [
              "5",
              "Bravery. To act when others quake in fear—this is the essence of the warrior. (Any)"
            ],
            [
              "6",
              "Perseverance. No injury or obstacle can turn me from my goal. (Any)"
            ]
          ]
        },
        "Marine Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "I face danger and evil to offset an unredeemable act in my past."
            ],
            [
              "2",
              "I. Will. Finish. The. Job."
            ],
            [
              "3",
              "I must set an example of hope for those who have given up."
            ],
            [
              "4",
              "An honorable pirate once saved me from an evil marine, and I now respect that pirate greatly."
            ],
            [
              "5",
              "Fear leads to tyranny, and both must be eradicated."
            ],
            [
              "6",
              "My commander betrayed my unit, and I will have revenge."
            ]
          ]
        },
        "Marine Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I have an unconditional hatred for pirates and criminals."
            ],
            [
              "2",
              "I find life outside the marines difficult and struggle to say the right thing in social situations."
            ],
            [
              "3",
              "My intensity can drive others away."
            ],
            [
              "4",
              "I hold grudges and have difficulty forgiving others."
            ],
            [
              "5",
              "I become irrational when innocent people are hurt."
            ],
            [
              "6",
              "I sometimes stay up all night listening to the ghosts of my fallen enemies."
            ]
          ]
        }
      ]
    },
    {
      "name": "Mercenary",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "investigation": true,
          "insight": true
        }
      ],
      "toolProficiencies": [
        {
          "anyGamingSet": 1,
          "disguise kit": true
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A Disguise Kit"
            },
            {
              "special": "common clothes"
            },
            {
              "special": "an insignia of your position in your organization or a personal symbol"
            },
            {
              "special": "a gaming set of your choice"
            },
            {
              "special": "a wallet containing the remainder of your last wages ฿100000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Mercenary Contact",
        "You have a reliable and trustworthy contact who acts as your liaison to a network of other mercenaries. You know how to get messages to and from your contact, even over great distances; specifically, you know the local messengers, greedy merchants, and corrupt marines who can deliver messages for you.",
        "Mercenary Organization",
        "Many organizations exist across the world, specifically in the grand line, that seek out wealth and power from behind the scenes. Collecting bounties, overthrowing kingdoms, or simply taking out specific figures is often what they are tasked with. You are a part of one of the following organizations. Choose from the following, or roll on the table below.",
        "Mercenary Organization",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Organization"
          ],
          "rows": [
            [
              "1",
              "Baroque Works"
            ],
            [
              "2",
              "Koala Mercenaries"
            ],
            [
              "3",
              "Germa 66"
            ],
            [
              "4",
              "New Giant Warrior Pirates"
            ],
            [
              "5",
              "Buggy's Delivery Service"
            ],
            [
              "6",
              "None (Lone Wolf)"
            ]
          ]
        },
        "Suggested Characteristics",
        "Your bond could be associated with the company you traveled with previously, or with the organization you are currently under. The ideal you embrace largely depends on your worldview and your motivation for being a mercenary.",
        "Mercenary Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I always have a plan for when things go wrong."
            ],
            [
              "2",
              "I am always calm, no matter what the situation. I never raise my voice or let my emotions control me."
            ],
            [
              "3",
              "The first thing I do in a new place is note the locations of everything valuable—or where such things could be hidden."
            ],
            [
              "4",
              "I can stare down a hell hound without flinching."
            ],
            [
              "5",
              "I have a crude sense of humor."
            ],
            [
              "6",
              "I face problems head-on. A simple, direct solution is the best path to success."
            ]
          ]
        },
        "Mercenary Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Honor. I don't steal from others in the trade. (Lawful)"
            ],
            [
              "2",
              "Freedom. Chains are meant to be broken, as are those who would forge them. (Chaotic)"
            ],
            [
              "3",
              "Greater Good. I clean the streets of any criminals that may harm the innocent. (Good)"
            ],
            [
              "4",
              "Greed. I will do whatever it takes to become wealthy. (Evil)"
            ],
            [
              "5",
              "People. I'm loyal to my friends, not to any ideals, and surely not to anyone else. (Neutral)"
            ],
            [
              "6",
              "Unity. My organization is all that matters. (Any)"
            ]
          ]
        },
        "Mercenary Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "I'm trying to pay off an old debt I owe to a generous benefactor."
            ],
            [
              "2",
              "My ill-gotten gains go to support my family."
            ],
            [
              "3",
              "Something important was taken from me, and I aim to steal it back."
            ],
            [
              "4",
              "I will become the greatest thief that ever lived."
            ],
            [
              "5",
              "I'm guilty of a terrible crime. I hope I can redeem myself for it."
            ],
            [
              "6",
              "Someone I loved died because of a mistake I made. That will never happen again."
            ]
          ]
        },
        "Mercenary Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "When I see something valuable, I can't think about anything but how to steal it."
            ],
            [
              "2",
              "When faced with a choice between money and my friends, I usually choose the money."
            ],
            [
              "3",
              "If there's a plan, I'll forget it. If I don't forget it, I'll ignore it."
            ],
            [
              "4",
              "I have a 'tell' that reveals when I'm lying."
            ],
            [
              "5",
              "I turn tail and run when things look bad."
            ],
            [
              "6",
              "An innocent person is in prison for a crime that I committed. I'm okay with that."
            ]
          ]
        }
      ]
    },
    {
      "name": "Merchant",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "investigation": true,
          "persuasion": true
        }
      ],
      "toolProficiencies": [
        {
          "anyArtisansTool": 2
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "Two sets of artisan's tools"
            },
            {
              "special": "merchant's scale"
            },
            {
              "special": "a set of fine clothes"
            },
            {
              "special": "a wallet containing ฿100000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Supply Chain",
        "From your time as a merchant, you retain connections with wholesalers, suppliers, and other merchants and entrepreneurs. You can call upon these connections when looking for items or information.",
        "Suggested Characteristics",
        "Being a merchant involved having a head for numbers, a strong personality, the ability to make deals with hostile adversaries, a strong sword arm to fight off bandits, and the intuition for knowing what people want and need. The art of business is the art of finding the best path to profit, and that path might be different with each transaction. It takes a strong mind and a stronger stomach to succeed. So why did you fail?",
        "Merchant Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I didn't have the cutthroat attitude necessary to succeed."
            ],
            [
              "2",
              "Even my competitors said I was affable and talented. Those traits should serve me well."
            ],
            [
              "3",
              "To prosper, you have to be in control."
            ],
            [
              "4",
              "The customer is always right."
            ],
            [
              "5",
              "If I can be everyone's friend, I'll always have support."
            ],
            [
              "6",
              "I'm a snob who looks down on those who can't appreciate fine art."
            ]
          ]
        },
        "Merchant Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Community. It is the duty of all civilized people to strengthen the bonds of community and the security of civilization. (Lawful)"
            ],
            [
              "2",
              "Generosity. My talents were given to me so that I could use them to benefit the world. (Good)"
            ],
            [
              "3",
              "Freedom. Everyone should be free to pursue his or her own livelihood. (Chaotic)"
            ],
            [
              "4",
              "Greed. I'm only in it for the money. (Evil)"
            ],
            [
              "5",
              "People. I'm committed to the people I care about, not to ideals. (Neutral)"
            ],
            [
              "6",
              "Aspiration. I work hard to be the best there is at my job. (Any)"
            ]
          ]
        },
        "Merchant Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "My family means everything to me."
            ],
            [
              "2",
              "I owe a dangerous person a lot of money. As long as they're happy, they let my debt rest unpaid."
            ],
            [
              "3",
              "I owe my teacher a great debt for forging me into the person I am today."
            ],
            [
              "4",
              "I will get revenge on the evil forces that destroyed my place of business and ruined my livelihood."
            ],
            [
              "5",
              "One day I will return to my home and prove that I am the greatest merchant of them all."
            ],
            [
              "6",
              "I pursue wealth to secure someone's love."
            ]
          ]
        },
        "Merchant Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I'll do anything to get my hands on something rare or priceless."
            ],
            [
              "2",
              "I'm quick to assume that someone is trying to cheat me."
            ],
            [
              "3",
              "No one must ever learn that I once stole money from another merchant."
            ],
            [
              "4",
              "I'm never satisfied with what I have—I always want more."
            ],
            [
              "5",
              "I would kill to acquire a noble title."
            ],
            [
              "6",
              "I'm horribly jealous of anyone who does my job better than me. Everywhere I go, I'm surrounded by rivals."
            ]
          ]
        }
      ]
    },
    {
      "name": "Noble",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "history": true,
          "persuasion": true
        }
      ],
      "toolProficiencies": [
        {
          "anyGamingSet": 2
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A set of fine clothes"
            },
            {
              "special": "a signet ring"
            },
            {
              "special": "a scroll of pedigree"
            },
            {
              "special": "a purse containing ฿250000"
            }
          ]
        }
      ],
      "entries": [
        "Variant Noble: Celestial Dragon (Optional)",
        "You were born into a family of aristocrats that are descendants of nineteen of the Twenty Kings who established what is now known as the World Government. Members of the celestial dragons are rarely seen in regular society, as many solely reside inside of Mariejois. Those who leave Mariejois permanently are rarely accepted back, and may be targeted by the world government and other celestial dragons.",
        "Feature: Position of Privilege",
        "Thanks to your noble birth, people are inclined to think the best of you. You are welcome in high society, and people assume you have the right to be wherever you are. The common folk make every effort to accommodate you and avoid your displeasure, and other people of high birth treat you as a member of the same social sphere. You may not even be affiliated with your birth family anymore, but you can secure an audience with just about any noble family if you need to.",
        "Suggested Characteristics",
        "Nobles are born and raised to a very different lifestyle than most people ever experience, and their personalities reflect that upbringing. A noble title comes with a plethora of bonds—responsibilities to family, to other nobles, to the people entrusted to the family's care, or even to the title itself. But this responsibility is often a good way to undermine a noble. Some run away from these responsibilities in order to live a more modest or adventurous lifestyle, though this is greatly frowned upon.",
        "Noble Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "My eloquent flattery makes everyone I talk to feel like the most wonderful and important person in the world."
            ],
            [
              "2",
              "The common folk love me for my kindness and generosity."
            ],
            [
              "3",
              "No one could doubt by looking at my regal bearing that I am a cut above the unwashed masses."
            ],
            [
              "4",
              "I take great pains to always look my best and follow the latest fashions."
            ],
            [
              "5",
              "I don't like to get my hands dirty, and I won't be caught dead in unsuitable accommodations."
            ],
            [
              "6",
              "Despite my noble birth, I do not place myself above other folk. We all have the same blood."
            ]
          ]
        },
        "Noble Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Respect. Respect is due to me because of my position, but all people regardless of station deserve to be treated with dignity. (Good)"
            ],
            [
              "2",
              "Responsibility. It is my duty to respect the authority of those above me, just as those below me must respect mine. (Lawful)"
            ],
            [
              "3",
              "Independence. I must prove that I can handle myself without coddling from my family. (Chaotic)"
            ],
            [
              "4",
              "Power. If I can attain more power, no one will tell me what to do, including my family. (Evil)"
            ],
            [
              "5",
              "Family. Blood runs thicker than water. (Any)"
            ],
            [
              "6",
              "Noble Obligation. It is my duty to protect and care for the people beneath me. (Good)"
            ]
          ]
        }
      ]
    },
    {
      "name": "Pirate",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "athletics": true,
          "perception": true
        }
      ],
      "toolProficiencies": [
        {
          "navigator's tools": true,
          "carpenter's tools": true
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A belaying pin (club)"
            },
            {
              "item": "rope"
            },
            {
              "special": "a lucky charm"
            },
            {
              "special": "a set of common clothes"
            },
            {
              "special": "a wallet containing ฿100000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Ship's Passage",
        "You're an experienced pirate. When you need to, you can secure free passage on a pirate ship for yourself and your adventuring companions. You might sail on the ship you served on, or another ship you have good relations with (perhaps one captained by a former crewmate). Because you're calling in a favor, you can't be certain of a schedule or route that will meet your every need. Your DM will determine how long it takes to get where you need to go. In return for your free passage, you and your companions are expected to assist the crew during the voyage.",
        "Suggested Characteristics",
        "Pirates can be a rough lot, but the responsibilities of life on a ship make them generally reliable as well. Living as a pirate can be dangerous, but is equally rewarding in the freedom and potential wealth it offers.",
        "Pirate Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "My friends know they can rely on me, no matter what."
            ],
            [
              "2",
              "I work hard so that I can play hard when the work is done."
            ],
            [
              "3",
              "I enjoy sailing into new ports and making new friends over a flagon of ale."
            ],
            [
              "4",
              "I stretch the truth for the sake of a good story."
            ],
            [
              "5",
              "To me, a tavern brawl is a nice way to get to know a new city."
            ],
            [
              "6",
              "I never pass up a friendly wager."
            ]
          ]
        },
        "Pirate Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Respect. The thing that keeps a ship together is mutual respect between captain and crew. (Good)"
            ],
            [
              "2",
              "Fairness. We all do the work, so we all share in the rewards. (Lawful)"
            ],
            [
              "3",
              "Freedom. The sea is freedom—the freedom to go anywhere and do anything. (Chaotic)"
            ],
            [
              "4",
              "Mastery. I'm a predator, and the other ships on the sea are my prey. (Evil)"
            ],
            [
              "5",
              "People. I'm committed to my crewmates, not to ideals. (Neutral)"
            ],
            [
              "6",
              "Aspiration. Someday, I'll own my own ship and chart my own destiny. (Any)"
            ]
          ]
        },
        "Pirate Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "I'm loyal to my captain first, everything else second."
            ],
            [
              "2",
              "The ship is most important—crewmates and captains come and go."
            ],
            [
              "3",
              "I'll always remember my first ship."
            ],
            [
              "4",
              "I was cheated out of my fair share of the profits, and I want to get my due."
            ],
            [
              "5",
              "Ruthless pirates murdered my captain and crewmates, plundered our ship, and left me to die. Vengeance will be mine."
            ],
            [
              "6",
              "I will find the greatest treasure of all, the One Piece!"
            ]
          ]
        },
        "Pirate Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I follow orders, even if I think they're wrong."
            ],
            [
              "2",
              "I'll say anything to avoid having to do extra work."
            ],
            [
              "3",
              "Once someone questions my courage, I never back down no matter how dangerous the situation."
            ],
            [
              "4",
              "Once I start drinking, it's hard for me to stop."
            ],
            [
              "5",
              "I can't help but pocket loose coins and other trinkets I come across."
            ],
            [
              "6",
              "My pride will probably lead to my destruction."
            ]
          ]
        }
      ]
    },
    {
      "name": "Revolutionary",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "deception": true,
          "stealth": true
        }
      ],
      "toolProficiencies": [
        {
          "poisoner's kit": true,
          "disguise kit": true
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A set of common clothes"
            },
            {
              "special": "a disguise kit"
            },
            {
              "special": "a black cloak with a hood"
            },
            {
              "special": "a poisoner's kit"
            },
            {
              "special": "a wallet containing ฿100000"
            }
          ]
        }
      ],
      "entries": [
        "Variant Revolutionary: Secret Agent (Optional)",
        "Revolutionaries have spies all over, infiltrating and deceiving various powerful organizations and government networks to bring back intelligence to the main revolutionary organization. When you take this option, with the DM's permission, you may choose to disguise yourself and deceive others into believing you have a different background for the purposes of keeping your connection to the revolutionaries a secret, or even infiltrating their group.",
        "By creating this fake identity for yourself, you may pick another background and replace up to three proficiencies or pieces of equipment with that background. You may also develop a fake persona as a mask to match your new background, though your real personality is different. Additionally, you are able to convince everyone you meet outside of the revolutionary network that you belong to the group corresponding to that background through the way you appear and act.",
        "Feature: Shadow Network",
        "You have access to the revolutionary shadow network, which allows you to communicate with other members of the order over long distances. If you gain access to a snailphone, you may input a special sequence into it to call any revolutionary member on standby without being intercepted.",
        "Suggested Characteristics",
        "Agents of the revolutionary army are all put through intense training and taught how to infiltrate any building or organization. Although the revolutionary army's true motives are unknown to outsiders, civilians are taught to fear their influence and hold over major kingdoms or governments. Revolutionaries are often extremely secretive, and may only reveal their true identities to lifelong friends or family whom they know they can trust.",
        "Revolutionary Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I prefer to keep my thoughts to myself."
            ],
            [
              "2",
              "A signature piece of clothing or distinct weapon serves as an emblem of who I am."
            ],
            [
              "3",
              "I never accept that I'm out of my depth."
            ],
            [
              "4",
              "I must know the answer to every secret. No door remains unopened in my presence."
            ],
            [
              "5",
              "I let people underestimate me, revealing my full competency only to those close to me."
            ],
            [
              "6",
              "It doesn't matter if the whole world's against me. I'll always do what I think is right."
            ]
          ]
        },
        "Revolutionary Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Honor. I always perform my duties effectively and as ordered. (Lawful)"
            ],
            [
              "2",
              "Freedom. Chains are meant to be broken, as are those who would forge them. (Chaotic)"
            ],
            [
              "3",
              "Charity. I steal from the wealthy so that I can help people in need. (Good)"
            ],
            [
              "4",
              "Absolute Justice. The people have been gullible for so long, they are just as guilty as the ones that deceive them. They also deserve to be punished. (Evil)"
            ],
            [
              "5",
              "People. I'm loyal to my friends, family, and fellow revolutionaries, nobody else matters. (Neutral)"
            ],
            [
              "6",
              "Redemption. There's a spark of good in everyone, even the corrupt elites. (Good)"
            ]
          ]
        },
        "Revolutionary Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "Everything I do is in the service of a powerful master, one I must keep a secret from everyone."
            ],
            [
              "2",
              "I've seen great darkness, and I'm committed to being a light against it—the light of all lights."
            ],
            [
              "3",
              "A great evil dwells within me. I will fight against it and the world's other evils for as long as I can."
            ],
            [
              "4",
              "The world has been convinced of a terrible lie. It's up to me to reveal the truth."
            ],
            [
              "5",
              "I use my cunning mind to solve mysteries and find justice for those who've been wronged."
            ],
            [
              "6",
              "I lost someone I care about, but I still see them in guilty visions, recurring dreams, or as a spirit."
            ]
          ]
        },
        "Revolutionary Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I follow orders, even if I think they're wrong."
            ],
            [
              "2",
              "I'm convinced something is after me, appearing in mirrors, dreams, and places where no one could."
            ],
            [
              "3",
              "I've done unspeakable evil and will do anything to prevent others from finding out."
            ],
            [
              "4",
              "I am exceptionally credulous and believe any story or legend immediately."
            ],
            [
              "5",
              "I'm a skeptic and don't believe in the power of rituals, religion, superstition, or spirits."
            ],
            [
              "6",
              "I know my future is written and that anything I do will lead to a prophesied end."
            ]
          ]
        }
      ]
    },
    {
      "name": "Sage",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "arcana": true,
          "history": true
        }
      ],
      "toolProficiencies": [
        {
          "cartographer's tools": true,
          "anyArtisansTool": 1
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A bottle of black ink"
            },
            {
              "special": "a quill"
            },
            {
              "special": "a small knife"
            },
            {
              "special": "a letter from a dead colleague posing a question you have not yet been able to answer"
            },
            {
              "special": "a set of common clothes"
            },
            {
              "special": "a wallet containing ฿100000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Researcher",
        "When you attempt to learn or recall a piece of lore, if you do not know that information, you often know where and from whom you can obtain it. Usually, this information comes from a library, scriptorium, university, or a sage or other learned person or creature. Your DM might rule that the knowledge you seek is secreted away in an almost inaccessible place, or that it simply cannot be found.",
        "Specialty",
        "To determine the nature of your scholarly training, roll a d8 or choose from the options in the table below.",
        "Field of Study",
        {
          "type": "table",
          "colLabels": [
            "d8",
            "Field"
          ],
          "rows": [
            [
              "1",
              "Alchemist"
            ],
            [
              "2",
              "Astronomer"
            ],
            [
              "3",
              "Discredited academic"
            ],
            [
              "4",
              "Librarian"
            ],
            [
              "5",
              "Professor"
            ],
            [
              "6",
              "Researcher"
            ],
            [
              "7",
              "Scientist"
            ],
            [
              "8",
              "Scribe"
            ]
          ]
        },
        "Suggested Characteristics",
        "Sages are defined by their extensive studies, and their characteristics reflect this life of study. Devoted to scholarly pursuits, a sage values knowledge highly—sometimes in its own right, sometimes as a means toward other ideals.",
        "\\columnbreak",
        "Sage Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I use polysyllabic words that convey the impression of great erudition."
            ],
            [
              "2",
              "I've read every book in the world's greatest libraries—or I like to boast that I have."
            ],
            [
              "3",
              "I'm used to helping out those who aren't as smart as I am, and I patiently explain anything and everything to others."
            ],
            [
              "4",
              "There's nothing I like more than a good mystery."
            ],
            [
              "5",
              "I'm willing to listen to every side of an argument before I make my own judgment."
            ],
            [
              "6",
              "I'm convinced that people are always trying to steal my secrets."
            ]
          ]
        },
        "Sage Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Knowledge. The path to power and self-improvement is through knowledge. (Neutral)"
            ],
            [
              "2",
              "Beauty. What is beautiful points us beyond itself toward what is true. (Good)"
            ],
            [
              "3",
              "Logic. Emotions must not cloud our logical thinking. (Lawful)"
            ],
            [
              "4",
              "No Limits. Nothing should fetter the infinite possibility inherent in all existence. (Chaotic)"
            ],
            [
              "5",
              "Power. Knowledge is the path to power and domination. (Evil)"
            ],
            [
              "6",
              "Self-Improvement. The goal of a life of study is the betterment of oneself. (Any)"
            ]
          ]
        },
        "Sage Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "It is my duty to protect my students."
            ],
            [
              "2",
              "I have an ancient text that holds terrible secrets that must not fall into the wrong hands."
            ],
            [
              "3",
              "I work to preserve a library, university, scriptorium, or monastery."
            ],
            [
              "4",
              "My life's work is a series of tomes related to a specific field of lore."
            ],
            [
              "5",
              "I've been searching my whole life for the answer to a certain question."
            ],
            [
              "6",
              "I strive to be the greatest in my field of study."
            ]
          ]
        },
        "Sage Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I am easily distracted by the promise of information."
            ],
            [
              "2",
              "Most people scream and run when they see a monster. I stop and take notes on its anatomy."
            ],
            [
              "3",
              "Unlocking an ancient mystery is worth the price of a civilization."
            ],
            [
              "4",
              "I overlook obvious solutions in favor of complicated ones."
            ],
            [
              "5",
              "I speak without really thinking through my words, invariably insulting others."
            ],
            [
              "6",
              "I can't keep a secret to save my life, or anyone else's."
            ]
          ]
        }
      ]
    },
    {
      "name": "Salvager",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "investigation": true,
          "perception": true
        }
      ],
      "toolProficiencies": [
        {
          "carpenter's tools": true,
          "cartographer's tools": true
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A set of artisan's tools (one of your choice)"
            },
            {
              "special": "an ancient artifact found in a sunken ship"
            },
            {
              "item": "traveler's clothes"
            },
            {
              "special": "a wallet containing ฿150000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Ship Salvager",
        "Through years of learning how to dive, hold your breath, and recover valuable items from sunken ships, you can reliably profit from salvaging any shipwreck you find. Whenever you locate a shipwreck, the valuables you find within will always be collectively worth at least ฿100,000. The time you can hold your breath underwater is also doubled.",
        "Suggested Characteristics",
        "Architects are resourceful collectors, treasure hunters, and divers.",
        "Salvager Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I love talking and being heard more than I like to listen."
            ],
            [
              "2",
              "I'm extremely fond of ruined ships and buildings."
            ],
            [
              "3",
              "I thrive under pressure."
            ],
            [
              "4",
              "I love competing to see who can hold their breath the longest."
            ],
            [
              "5",
              "I'm not afraid of hard work—in fact, I prefer it."
            ],
            [
              "6",
              "I don't mind getting my hands dirty."
            ]
          ]
        },
        "Salvager Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Crew. If everyone on deck pitches in, we'll always do a great job. (Good)"
            ],
            [
              "2",
              "Careful Lines. A proper salvage requires following protocol. (Lawful)"
            ],
            [
              "3",
              "Invention. Make what you need out of whatever is at hand. (Chaotic)"
            ],
            [
              "4",
              "Perfection. To measure a being and find it lacking is the greatest disappointment. (Evil)"
            ],
            [
              "5",
              "Reflection. Muddied water always clears in time. (Any)"
            ],
            [
              "6",
              "Hope. The horizon at sea holds the greatest promise. (Any)"
            ]
          ]
        },
        "Salvager Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "I must find a legendary shipwreck located in the most dangerous sea."
            ],
            [
              "2",
              "Much of the treasure I claim will be used to enrich my community."
            ],
            [
              "3",
              "I will recover an artifact that was stolen from me out of a shipwreck long ago."
            ],
            [
              "4",
              "I repair broken things to redeem what's broken in myself."
            ],
            [
              "5",
              "I will become the greatest diver that ever lived."
            ],
            [
              "6",
              "A sea monster destroyed my ship; its head will be mounted on my frame."
            ]
          ]
        },
        "Salvager Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I don't know when to throw something away. You never know when it might be useful again."
            ],
            [
              "2",
              "I become depressed and anxious if I'm away from the sea too long."
            ],
            [
              "3",
              "I am better at ripping through things than putting them together."
            ],
            [
              "4",
              "I am so obsessed with diving that I frequently get decompression sickness."
            ],
            [
              "5",
              "I am judgmental, especially of those I deem homebodies or otherwise lazy."
            ],
            [
              "6",
              "I sometimes take things that don't belong to me, especially if they are very well made."
            ]
          ]
        }
      ]
    },
    {
      "name": "Samurai",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "insight": true,
          "history": true
        }
      ],
      "toolProficiencies": [
        {
          "smith's tools": true,
          "anyArtisansTool": 1
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A valuable katana sheath that holds sentimental value"
            },
            {
              "special": "a Flute (Shakuhachi) or Lute (Biwa)"
            },
            {
              "special": "a Hakama or Kimono"
            },
            {
              "special": "a set of common clothes"
            },
            {
              "special": "฿150000"
            }
          ]
        }
      ],
      "entries": [
        "Variant Samurai: Ninja (Optional)",
        "A ninja is a warrior, typically born in Wano Kuni, who possesses great skills primarily in infiltration, espionage, and assassination. If you wish to take this option, you may replace one or more of your skill proficiencies with Acrobatics, Deception, or Stealth. Additionally, you may replace your proficiency in Smith's Tools with Thieves' Tools or a Disguise Kit instead.",
        "Feature: Social Status",
        "Samurai tend to have high social status in their countries, such as Wano Kuni, allowing them to exercise social power over lower class citizens. Many outsiders who encounter samurai will show great respect for their status and skills, perhaps even to the point of fearing their abilities.",
        "Suggested Characteristics",
        "Samurai are not only high on the social ladder, but they are expected to follow a code of honor that makes them highly educated, disciplined, and honorable. Additionally, they are known to be extremely prideful, caring greatly about their honor and loyalty to their master or family.",
        "Samurai Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I'm always polite and respectful."
            ],
            [
              "2",
              "I face problems head-on. A simple, direct solution is the best path to success."
            ],
            [
              "3",
              "I enjoy being strong and like breaking things."
            ],
            [
              "4",
              "I've left emotion behind me. I'm now perfectly placid."
            ],
            [
              "5",
              "I'm confident in my own abilities and do what I can to instill confidence in others."
            ],
            [
              "6",
              "Despite my social class, I do not place myself above other folk. We all have the same blood."
            ]
          ]
        },
        "Samurai Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Order. The will of my master and family is absolute. (Lawful)"
            ],
            [
              "2",
              "Independence. When people follow orders blindly, they embrace a kind of tyranny. (Chaotic)"
            ],
            [
              "3",
              "Death. The penalty for dishonor is death. (Evil)"
            ],
            [
              "4",
              "Determination. I cannot fail. Not ever. (Neutral)"
            ],
            [
              "5",
              "Greater Good. Our lot is to lay down our lives in defense of others. (Good)"
            ],
            [
              "6",
              "Nation. My city, nation, or people are all that matter. (Any)"
            ]
          ]
        },
        "Samurai Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "I would still lay down my life for my master or family."
            ],
            [
              "2",
              "Someone saved my life on the battlefield. To this day, I will never leave a friend behind."
            ],
            [
              "3",
              "My honor is my life."
            ],
            [
              "4",
              "I'll never forget the crushing defeat my family suffered or the enemies who dealt it."
            ],
            [
              "5",
              "Those who fight beside me are those worth dying for."
            ],
            [
              "6",
              "I will become the strongest to restore honor to my family."
            ]
          ]
        },
        "Samurai Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "The monstrous foe I once faced in battle still leaves me quivering with fear."
            ],
            [
              "2",
              "I have little respect for anyone who is not a proven warrior."
            ],
            [
              "3",
              "I suffered defeat, humiliation, and dishonor long ago. Nobody must ever hear of this."
            ],
            [
              "4",
              "My hatred of my enemies is blinding and unreasoning."
            ],
            [
              "5",
              "I obey my code, even if the code causes misery."
            ],
            [
              "6",
              "I'd rather eat my weapon than admit when I'm wrong."
            ]
          ]
        }
      ]
    },
    {
      "name": "Savage",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "nature": true,
          "survival": true
        }
      ],
      "toolProficiencies": [
        {
          "anyMusicalInstrument": 1,
          "anyArtisansTool": 1
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A staff"
            },
            {
              "special": "a hunting trap"
            },
            {
              "special": "a trophy from an animal you killed"
            },
            {
              "item": "traveler's clothes"
            },
            {
              "special": "฿100000 worth of gems and ores"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Wanderer",
        "Growing up in the wilderness to fend for yourself, you have an excellent memory for maps and geography, and you can always recall the general layout of terrain, settlements, and other features around you. In addition, you can find food and fresh water for yourself and up to five other people each day, provided that the land offers berries, small game, water, and so forth.",
        "Suggested Characteristics",
        "Often considered rude and uncouth among civilized folk, savages have little respect for the niceties of life in the cities. The ties of the natural world and close friends or family of which they are a part are the most important bonds to most savages.",
        "Savage Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I'm driven by a wanderlust that led me away from home."
            ],
            [
              "2",
              "I watch over my friends as if they were a litter of newborn pups."
            ],
            [
              "3",
              "I once ran twenty-five miles without stopping to bring medicine back a friend. I'd do it again if I had to."
            ],
            [
              "4",
              "I'm always picking things up, absently fiddling with them, and sometimes accidentally breaking them."
            ],
            [
              "5",
              "I place no stock in wealthy or well-mannered folk. Money and manners won't save you from a hungry tiger."
            ],
            [
              "6",
              "I was, in fact, raised by wolves."
            ]
          ]
        },
        "Savage Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Change. Life is like the seasons, in constant change, and we must change with it. (Chaotic)"
            ],
            [
              "2",
              "Greater Good. It is each person's responsibility to make the most happiness for the whole world. (Good)"
            ],
            [
              "3",
              "Freedom. Tyrants must not be allowed to oppress the people. (Chaotic)"
            ],
            [
              "4",
              "Might. If I become strong, I can take what I want—what I deserve. (Evil)"
            ],
            [
              "5",
              "Nature. The natural world is more important than all the constructs of civilization. (Neutral)"
            ],
            [
              "6",
              "Destiny. Nothing and no one can steer me away from my higher calling. (Any)"
            ]
          ]
        },
        "Savage Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "My family and friends are the most important thing in my life, even if they are far from me."
            ],
            [
              "2",
              "I protect those who cannot protect themselves."
            ],
            [
              "3",
              "I will bring terrible wrath down on the evildoers who destroyed my homeland."
            ],
            [
              "4",
              "I am the last of my kind, and it is up to me to ensure their names enter legend."
            ],
            [
              "5",
              "I suffer awful visions of a coming disaster and will do anything to prevent it."
            ],
            [
              "6",
              "I will explore the world and see all of its natural splendor."
            ]
          ]
        },
        "Savage Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I am too enamored of ale, wine, and other intoxicants."
            ],
            [
              "2",
              "There's no room for caution in a life lived to the fullest."
            ],
            [
              "3",
              "I remember every insult I've received and nurse a silent resentment toward anyone who's ever wronged me."
            ],
            [
              "4",
              "I am slow to trust city folk and those I've never met."
            ],
            [
              "5",
              "Violence is my answer to almost any challenge."
            ],
            [
              "6",
              "I become depressed and anxious if I'm away from nature too long."
            ]
          ]
        }
      ]
    },
    {
      "name": "Thief",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "deception": true,
          "sleight of hand": true
        }
      ],
      "toolProficiencies": [
        {
          "anyArtisansTool": 1,
          "thieves' tools": true
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "item": "crowbar"
            },
            {
              "special": "a set of dark common clothes including a hood"
            },
            {
              "special": "wallet containing ฿150000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Bribery",
        "Through years of bribing and deceiving law enforcement, pirates, and the marines, you've learned how to reliably avoid punishment for less severe crimes such as petty theft (stealing anything under ฿1,000) and littering, with the DM's discretion to determine leniency. Even when you are punished for more severe crimes, you are able to halve the duration of your punishment or imprisonment.",
        "Specialty",
        "There are many kinds of criminals and thieves, or individual members of organizations have particular specialties. Each thief has a strong preferences for certain kinds of crimes over others. Choose the role you played in your thieving life, or roll on the table below.",
        "Specialty Table",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Specialty"
          ],
          "rows": [
            [
              "1",
              "Bank Heister"
            ],
            [
              "2",
              "Burglar"
            ],
            [
              "3",
              "Fence"
            ],
            [
              "4",
              "Highway Robber"
            ],
            [
              "5",
              "Grave Robber"
            ],
            [
              "6",
              "Pickpocket"
            ]
          ]
        },
        "Suggested Characteristics",
        "Thieves might seem like villains on the surface, and many of them are villainous to the core. But some have an abundance of endearing, if not redeeming, characteristics. There might be honor among thieves, but criminals rarely show any respect for law or authority.",
        "Thief Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I always have a plan for when things go wrong."
            ],
            [
              "2",
              "I am always calm, no matter what the situation. I never raise my voice or let my emotions control me."
            ],
            [
              "3",
              "The first thing I do in a new place is note the locations of everything valuable—or where such things could be hidden."
            ],
            [
              "4",
              "I am incredibly slow to trust. Those who seem the fairest often have the most to hide."
            ],
            [
              "5",
              "I would rather make a new friend than a new enemy."
            ],
            [
              "6",
              "I blow up at the slightest insult."
            ]
          ]
        },
        "Thief Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Honor. I don't steal from others in the trade. (Lawful)"
            ],
            [
              "2",
              "Freedom. Chains are meant to be broken, as are those who would forge them. (Chaotic)"
            ],
            [
              "3",
              "Charity. I steal from the wealthy so that I can help people in need. (Good)"
            ],
            [
              "4",
              "Greed. I will do whatever it takes to become wealthy. (Evil)"
            ],
            [
              "5",
              "Live and Let Live. Meddling in the affairs of others is a great way to get squashed like a bug. (Neutral)"
            ],
            [
              "6",
              "Redemption. There's a spark of good in everyone. (Good)"
            ]
          ]
        },
        ".",
        ".",
        "Thief Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "I'm trying to pay off an old debt I owe to a generous benefactor."
            ],
            [
              "2",
              "My ill-gotten gains go to support my family and homeland."
            ],
            [
              "3",
              "Something important was taken from me, and I aim to steal it back."
            ],
            [
              "4",
              "I will become the greatest thief that ever lived."
            ],
            [
              "5",
              "I'm guilty of a terrible crime. I hope I can redeem myself for it."
            ],
            [
              "6",
              "Someone I loved died because of a mistake I made. That will never happen again."
            ]
          ]
        },
        "Thief Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "When I see something valuable, I can't think about anything but how to steal it."
            ],
            [
              "2",
              "When faced with a choice between money and my friends, I usually choose the money."
            ],
            [
              "3",
              "I have trouble trusting anyone but myself."
            ],
            [
              "4",
              "I have a 'tell' that reveals when I'm lying."
            ],
            [
              "5",
              "I turn tail and run when things look bad."
            ],
            [
              "6",
              "An innocent person is in prison for a crime that I committed. I'm okay with that."
            ]
          ]
        }
      ]
    },
    {
      "name": "Zealot",
      "source": "D&DF",
      "skillProficiencies": [
        {
          "insight": true,
          "religion": true
        }
      ],
      "toolProficiencies": [
        {
          "anyArtisansTool": 2
        }
      ],
      "startingEquipment": [
        {
          "_": [
            {
              "special": "A holy symbol"
            },
            {
              "special": "holy scripture"
            },
            {
              "special": "5 sticks of incense"
            },
            {
              "special": "vestments"
            },
            {
              "special": "a set of common clothes"
            },
            {
              "special": "wallet containing ฿150000"
            }
          ]
        }
      ],
      "entries": [
        "Feature: Shelter of the Faithful",
        "As a zealot, you command the respect of those who share your faith, and you can perform the religious ceremonies of your god. You and your adventuring companions can expect to receive free healing and care at a temple, shrine, or other established presence of your faith, though you must provide any material components needed. Those who share your religion will support you (but only you) at a modest lifestyle.",
        "You might also have ties to a specific temple dedicated to your chosen deity or pantheon, and you have a residence there. This could be the temple where you used to serve, if you remain on good terms with it, or a temple where you have found a new home. While near your temple, you can call upon the priests for assistance, provided the assistance you ask for is not hazardous and you remain in good standing with your temple.",
        "Suggested Characteristics",
        "Zealots are shaped by their experience in temples or other religious communities. Their study of the history and tenets of their faith and their relationships to temples, shrines, or hierarchies affect their mannerisms and ideals. Their flaws might be some hidden hypocrisy or heretical idea, or an ideal or bond taken to an extreme.",
        "Zealot Personality Traits",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Personality Trait"
          ],
          "rows": [
            [
              "1",
              "I idolize a particular hero of my faith, and constantly refer to that person's deeds and example."
            ],
            [
              "2",
              "I can find common ground between the fiercest enemies, empathizing with them and always working toward peace."
            ],
            [
              "3",
              "I see omens in every event and action. The gods try to speak to us, we just need to listen."
            ],
            [
              "4",
              "Nothing can shake my optimistic attitude."
            ],
            [
              "5",
              "I quote (or misquote) sacred texts and proverbs in almost every situation."
            ],
            [
              "6",
              "I am tolerant (or intolerant) of other faiths and respect (or condemn) the worship of other gods."
            ]
          ]
        },
        "Zealot Ideals",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Ideal"
          ],
          "rows": [
            [
              "1",
              "Tradition. The ancient traditions of worship and sacrifice must be preserved and upheld. (Lawful)"
            ],
            [
              "2",
              "Charity. I always try to help those in need, no matter what the personal cost. (Good)"
            ],
            [
              "3",
              "Change. We must help bring about the changes the gods are constantly working in the world. (Chaotic)"
            ],
            [
              "4",
              "Power. I hope to one day rise to the top of my faith's religious hierarchy. (Lawful)"
            ],
            [
              "5",
              "Faith. I trust that my god will guide my actions. I have faith that if I work hard, things will go well. (Lawful)"
            ],
            [
              "6",
              "Redemption. There's a spark of good in everyone. (Good)"
            ]
          ]
        },
        "Zealot Bonds",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Bond"
          ],
          "rows": [
            [
              "1",
              "I would die to recover an ancient relic of my faith that was lost long ago."
            ],
            [
              "2",
              "I will someday get revenge on the corrupt temple hierarchy who branded me a heretic."
            ],
            [
              "3",
              "I owe my life to the priest who took me in when my parents died."
            ],
            [
              "4",
              "Everything I do is for the common people."
            ],
            [
              "5",
              "I will do anything to protect the temple where I served."
            ],
            [
              "6",
              "I must spread my faith to all who seem willing to listen."
            ]
          ]
        },
        "Zealot Flaws",
        {
          "type": "table",
          "colLabels": [
            "d6",
            "Flaw"
          ],
          "rows": [
            [
              "1",
              "I judge others harshly, and myself even more severely."
            ],
            [
              "2",
              "I put too much trust in those who wield power within my temple's hierarchy."
            ],
            [
              "3",
              "My piety sometimes leads me to blindly trust those that profess faith in my god."
            ],
            [
              "4",
              "I am inflexible in my thinking."
            ],
            [
              "5",
              "I am suspicious of strangers and expect the worst of them."
            ],
            [
              "6",
              "Once I pick a goal, I become obsessed with it to the detriment of everything else in my life."
            ]
          ]
        }
      ]
    }
  ],
  "item": [    
    {
      "name": "Attack Cuisine",
      "entries": [
        "A character who eats this powerful meal regains 2d4 + 2 hit points. Eating it all takes an action."
      ],
      "type": "G",
      "cost": { "unit": "฿", "value": 500000 },
      "weight": 2,
      "page": 147,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Bazooka Rounds (20)",
      "entries": [
        "Ammunition for bazookas and similar heavy firearms. Typically used in military or pirate-grade weaponry."
      ],
      "type": "G",
      "cost": { "unit": "฿", "value": 100000 },
      "weight": 5,
      "page": 147,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Case, Gun Bullets",
      "entries": [
        "This wooden case can hold up to twenty gun bullets or five bazooka rounds."
      ],
      "type": "G",
      "cost": { "unit": "฿", "value": 10000 },
      "weight": 1,
      "page": 147,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Fire Explosive",
      "entries": [
        "Explosives require a method of being lit using heat or fire, and then being thrown. As an action, you can throw this explosive up to 20 feet, letting it explode where it lands.",
        "Make a ranged attack against a creature or object, treating it as an improvised weapon. On a hit, the target takes 1d4 fire damage at the start of each of its turns.",
        "If it hits flammable material, it burns away a random 5-foot cube per round. A creature can extinguish the fire with a DC 10 Dexterity check or water."
      ],
      "type": "G",
      "cost": { "unit": "฿", "value": 500000 },
      "weight": 1,
      "page": 147,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Gun Bullets (20)",
      "entries": [
        "Standard ammunition for pistols and rifles used by pirates, marines, and bounty hunters."
      ],
      "type": "G",
      "cost": { "unit": "฿", "value": 10000 },
      "weight": 1.5,
      "page": 147,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Handcuffs",
      "entries": [
        "Metal restraints designed to bind a Small or Medium creature. Escaping requires a DC 20 Dexterity check; breaking them requires a DC 20 Strength check.",
        "They come with one key. A creature proficient with thieves' tools can pick the lock with a DC 15 Dexterity check.",
        "Handcuffs have 15 hit points."
      ],
      "type": "G",
      "cost": { "unit": "฿", "value": 20000 },
      "weight": 6,
      "page": 147,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Log Pose",
      "entries": [
        "A log pose, similar to a compass, helps navigators find their way to nearby islands or locations.",
        "It records magnetic waves unique to each island, allowing safe travel on the Grand Line.",
        "Paradise log poses do not work in the New World; a New World log pose (ten times more expensive) is required there."
      ],
      "type": "G",
      "cost": { "unit": "฿", "value": 500000 },
      "weight": 0.25,
      "page": 147,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Pirate's Pack",
      "type": "G",
      "cost": { "unit": "฿", "value": 320000 },
      "weight": 24,
      "page": 147,
      "source": "D&DF-PHB",
      "rarity": "none",
      "entries": [
        "Includes",
        {
          "type": "list",
          "items": [
            "a {@item chest|phb}",
            "a {@item Ball Bearings (Bag of 1,000)|phb|bag of 1,000 ball bearings}",
            "2 cases for maps and scrolls",
            "a {@item travelers' clothes|phb}",
            "an {@item ink pen|phb}",
            "a bottle of ink and 5 sheets of paper",
            "a {@item hammer|phb}",
            "{@item soap|phb|}",
            "a {@item lamp|phb}",
            "2 {@item Oil (flask)|phb|flasks of oil}",
            "20 days {@item Rations (1 day)|phb|rations}",
            "a {@item tankard|phb}",
            "a {@item fishing tackle|phb}",
            "a small knife."            
          ]
        },
        "the pack also has {@item Hempen Rope (50 feet)|phb|50 feet of hempen rope} strapped to the side of it."
      ]
    },    
    {
      "name": "Power Source",
      "entries": [
        "A special item—battery, dial, energy crystal, or fuel rod—designed to channel energy for abilities or spells.",
        "Tinkerers can use it as a spellcasting focus for technological or energy-based powers."
      ],
      "type": "G",
      "cost": { "unit": "฿", "value": 100000 },
      "weight": 3,
      "page": 147,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Steel Wootz Armor",
      "entries": [
        "Consists of shaped, interlocking steel plates to cover the entire body. A suit of plate includes gauntlets, heavy leather boots, giant shoulder plates, and thick layers of padding underneath the armor. Sometimes comes in a gold coating."
      ],
      "type": "HA",
      "ac": 18,
      "strength": 15,
      "stealth": true,
      "cost": { "unit": "฿", "value": 15000000 },
      "weight": 65,
      "page": 140,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Dense Coat",
      "entries": ["This type of coat is a made from durable fabrics and materials that provides basic protection."],
      "type": "LA",
      "ac": 11,
      "stealth": true,
      "cost": { "unit": "฿", "value": 50000 },
      "weight": 8,
      "page": 140,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Light Bulletproof Shirt",
      "entries": ["An undershirt consisting of durable synthetic fibers that provides noticeable protection against bullets and other weapons."],
      "type": "LA",
      "ac": 12,
      "cost": { "unit": "฿", "value": 450000 },
      "weight": 9,
      "page": 140,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Thick Shirt",
      "entries": ["Thicker shirts consist of high-quality quilted cloth or leathers that don't hinder flexibility."],
      "type": "LA",
      "ac": 11,
      "cost": { "unit": "฿", "value": 100000 },
      "weight": 6,
      "page": 140,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Bulletproof Jacket",
      "entries": [
        "A protective jacket consisting of durable synthetic fibers that provides decent protection against bullets and other weapons without making too much noise."
      ],
      "type": "MA",
      "ac": 13,
      "dexterityMax": 2,
      "cost": { "unit": "฿", "value": 500000 },
      "weight": 11,
      "page": 140,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Bulletproof Suit",
      "entries": [
        "This armor consists of fully bulletproof materials made from durable synthetic fibers. Your vital organs are completely protected by this suit, though your legs and arms are left partially uncovered."
      ],
      "type": "MA",
      "ac": 14,
      "dexterityMax": 2,
      "cost": { "unit": "฿", "value": 4000000 },
      "weight": 14,
      "page": 140,
      "source": "D&DF-PHB",
      "rarity": "none"
    },
    {
      "name": "Sea King Half Plate",
      "source": "D&DF-PHB",
      "page": 140,
      "type": "MA",
      "rarity": "none",
      "ac": 15,
      "dexterityMax": 2,
      "cost": { "unit": "฿", "value": 75000000 },
      "weight": 40,
      "stealth": true,
      "entries": [
        "This half plate armor is crafted from nearly impenetrable Sea King hide and scale plating that covers most of the wearer's body."
      ]
    },
  ]
}